import {
    Accordion, AccordionSummary, AccordionDetails,
    Box,
    Breadcrumbs,
    Divider,
    Link, Paper,
    Stack, Tab, Tabs,
    Typography,
} from "@mui/material";
import NavigateNextIcon from '@mui/icons-material/NavigateNext';
import {useNavigate} from "react-router-dom";
import React, {useEffect, useState} from "react";

const imageList: { [key: string]: string[] } = {
    '가의도 마늘': ['20200715_080318.jpg', '20200715_090952.jpg', '20200715_094229.jpg', '20200715_095704.jpg', '20200715_095923.jpg', '20200715_100003.jpg', '20200715_102416.jpg', '20200715_103136.jpg', '20200715_113002.jpg', '20200715_113354.jpg', '20200715_113418.jpg', '20200715_113431.jpg', '20200715_113454.jpg', '20200715_113604.jpg', '20200715_113617.jpg', '20200715_114047.jpg', '20200715_114055.jpg', '20200715_114200.jpg', '20200715_114203.jpg', '20200715_120534.jpg', '20200715_120654.jpg', '20200715_121219.jpg', '20200715_121226.jpg', '20200715_121321.jpg', '20200715_121338.jpg', '20200715_123015.jpg', '20200715_123347.jpg', '20200715_123357.jpg', '20200715_202832.jpg', '20200716_134351.jpg', '20200716_134525.jpg'],
    '감미콩': ['20220608_120644.jpg', '20220608_120645.jpg', '20220608_120657.jpg', '20220608_120708.jpg', '20220608_120718.jpg', '20220608_120740.jpg', '20220608_120752.jpg', '20220608_120800.jpg', '20220608_120817.jpg', '20220608_120822.jpg', '20220608_120830.jpg', '20220608_120855.jpg', '20220608_120906.jpg', '20220608_120946.jpg', '20220608_122353.jpg', '20220608_122402.jpg', '20220608_122407.jpg', '20220608_122514.jpg', '20220608_123453.jpg', '20220608_123456.jpg', '20220608_123632.jpg', '20220608_123636.jpg', '20220608_130020.jpg', '20220608_130049.jpg', '20220608_130106.jpg', '20220608_130125.jpg', '20220608_130144.jpg', '20220608_130154.jpg', '20220608_130225.jpg'],
    '감참외': ['20200725_114857.jpg', '20200725_114909.jpg', '20200725_114915.jpg'],
    '개구리참외': ['20200725_115056.jpg', '20210528_170700.jpg', '20210528_170725.jpg', '20210528_170757.jpg', '20210528_170801.jpg', '20210528_170845.jpg', '20210528_170848.jpg', '20210528_170853.jpg', '20210528_170924.jpg'],
    '광시': ['20201204_104030.jpg', '20201204_104857.jpg', '20201204_104906.jpg', '20201204_104950.jpg', '20201204_104954.jpg', '20201204_104957.jpg'],
    '구억배추': ['1643861068134.jpg', '1643861071651.jpg', '1643861074408.jpg', '1643861075669.jpg', '1643861078318.jpg', '1643861081126.jpg', '1643861084405.jpg', '1643861087530.jpg', '1643861091743.jpg', '1643861093310.jpg', '1643861096942.jpg', '1643861098451.jpg', '1643861099932.jpg', '1643861101432.jpg', '20220120_154439.jpg', '20220120_155404.jpg', '20220120_155434.jpg', '20220120_160731.jpg', '20220120_160738.jpg', '20220120_170930.jpg', '20220120_170942.jpg', '20220120_170948.jpg', '20220120_171017.jpg', '20220120_171028.jpg', '20220120_171515.jpg', '20220120_171516.jpg', '20220120_171602.jpg', '20220120_171708.jpg'],
    '귀향초': ['P1550277.JPG', 'P1550279-2.JPG', 'P1550281.JPG', 'P1550284.JPG'],
    '금산마늘': ['20241001_102828.jpg', '20241001_102839.jpg', '20241001_102848.jpg', '20241001_102910.jpg', '20241001_102925.jpg', '20241001_102933.jpg', '20241001_102949.jpg', '20241001_103001.jpg', '20241001_105644.jpg', '20241001_105646.jpg', '20241001_105748.jpg', '20241001_105936.jpg', '20241001_110008.jpg'],
    '김포 들미': ['0210430_160559.jpg', '0210430_161843.jpg', '0210430_161910.jpg', '0210430_162113.jpg', '0210430_162514.jpg'],
    '김포 자광벼': ['20200210_165150.jpg', '20200212_114348.jpg', '20200212_115149.jpg', '20200212_115157.jpg', '20200212_115317.jpg', '20200212_115320.jpg', '20200212_122249.jpg', '20200212_122508.jpg', '20200212_122551.jpg', '20200212_122731.jpg', '20200212_122749.jpg'],
    '돌동부': ['20201002_122736.jpg', '20201002_144736.jpg', '20201002_144756.jpg', '20201002_144808.jpg', '20201002_144818.jpg', '20201002_144829.jpg', '20201002_144854.jpg', '20201002_144904.jpg', '20201002_144915.jpg', '20201002_144931.jpg', '20201002_145202.jpg', '20201002_145219.jpg', '20201002_145823.jpg', '20201002_145832.jpg', '20201002_145840.jpg', '20220822_082052.jpg', '20220822_082054.jpg', '20220822_082105.jpg', '20220822_082115.jpg', '20220822_082128.jpg', '20220822_082132.jpg'],
    '돌산': ['20210319_095835.jpg', '20210319_095939.jpg', '20210319_101315.jpg', '20210319_101706.jpg', '20210319_103343.jpg', '20210319_103346.jpg', '20210319_105448.jpg', '20210319_110454.jpg', '20210319_111542.jpg', '20210319_111750.jpg', '20210319_111816.jpg', '20210319_111828.jpg', '20220402_104933.jpg', '20220402_104942.jpg', '20220402_104944.jpg', '20220402_104950.jpg', '20220402_105146.jpg'],
    '매꽃이 상추 논산 신화2리': ['1643861218098.jpg', '1643861222882.jpg', '1643861224480.jpg', '1643861226072.jpg', '1643861227488.jpg', '1643861229012.jpg', '1643861230611.jpg', '1643861232249.jpg', '1643861234378.jpg', '1643861271933.jpg', '1643861275614.jpg', '1643861277253.jpg', '1643861443525.jpg', '1643861447575.jpg', '1643861455021.jpg', '20220203_110813.jpg', '20220203_112130.jpg', '20220203_112353.jpg', '20220203_112359.jpg', '20220203_112400.jpg', '20220203_112405.jpg', '20220203_112409.jpg', '20220203_112413.jpg', '20220203_112424.jpg', '20220203_112447.jpg', '20220203_112638.jpg', '20220203_112805.jpg', '20220203_112808.jpg', '20220203_112850.jpg', '20220203_112853.jpg', '20220504_122721.jpg', '20220504_122815.jpg'],
    '목화': ['20230902_101327.jpg', '20230902_101335.jpg', '20230902_101344.jpg', '20230902_101347.jpg', '20230902_101355.jpg', '20230902_101359.jpg', '20230902_101406.jpg', '20230902_101409.jpg', '20230902_101414.jpg', '20230902_101420.jpg', '20230902_101425.jpg', '20230902_101431.jpg', '20230902_101433.jpg', '20230902_101447.jpg', '20230902_101449.jpg', '20230902_101452.jpg'],
    '보령 조선배추': ['20201030_133459.jpg', '20201030_133506.jpg', '20201030_133531.jpg', '20201030_133615.jpg', '20201030_133621.jpg', '20201030_133634.jpg', '20201030_133651.jpg', '20201030_133727.jpg', '20201030_133732.jpg', '20201030_133738.jpg', '20201030_133949.jpg', '20201030_134103.jpg', '20201030_134107.jpg', '20201030_134451.jpg', '20201030_134453.jpg', '20201030_134538.jpg', '20201030_134543.jpg', '20201030_135613.jpg', '20201030_135624.jpg', '20201030_135628.jpg', 'Resized_20210307_191909.jpeg'],
    '보령연지리 토종': ['20210305_135444.jpg', '20210305_135448.jpg', '20210305_135451.jpg', '20210305_135702.jpg', '20210305_135936.jpg', '20210305_135939.jpg', '20210305_135944.jpg', '20210305_140339.jpg', '20210305_140432.jpg', '20210305_141529.jpg', '20210305_141546.jpg', '20210305_141554.jpg', '20210305_141827.jpg', '20210305_141931.jpg', '20210305_141934.jpg', '20210305_141939.jpg', '20210305_142428.jpg', '20210305_143427.jpg', '20210305_143443.jpg'],
    '봉평 메밀': ['20241116_134257.jpg', '20241116_134259.jpg', '20241116_134308.jpg', '20241116_134314.jpg', '20241116_134324.jpg', '20241116_134337.jpg'],
    '봉화': ['20201022_105523.jpg', '20201022_105548.jpg', '20201022_105555.jpg', '20201022_105608.jpg', '20201022_105613.jpg', '20201022_105617.jpg', '20201022_113636.jpg', '20201022_113704.jpg', '20201022_114111.jpg', '20201022_114454.jpg', '20201022_114605.jpg', '20201022_114647.jpg', '20201022_114843.jpg', '20201022_114938.jpg', '20201022_114944.jpg', '20201022_114949.jpg', '20201022_133107.jpg', '20201022_133150.jpg', '20201022_133206.jpg', '20201022_133245.jpg', '20201022_133247.jpg', '20201022_133352.jpg', '20201022_133829.jpg', '20201022_141401.jpg', '20201023_050549.jpg', 'IMG_0454.JPG', 'IMG_0455.JPG', 'IMG_0456.JPG', 'IMG_0458.JPG', 'IMG_0459.JPG', 'IMG_0461.JPG', 'IMG_0462.JPG', 'IMG_0463.JPG', 'IMG_0466.JPG', 'IMG_0467.JPG', 'IMG_0468.JPG', 'IMG_0469.JPG', 'IMG_0470.JPG', 'IMG_0471.JPG', 'IMG_0472.JPG', 'IMG_0473.JPG', 'IMG_0474.JPG', 'IMG_0475.JPG', 'IMG_0476.JPG', 'IMG_0477.JPG', 'IMG_0478.JPG', 'IMG_0479.JPG', 'IMG_0480.JPG', 'IMG_0483.JPG', 'IMG_0484.JPG', 'IMG_0485.JPG', 'IMG_0486.JPG', 'IMG_0487.JPG', 'IMG_0488.JPG', 'IMG_0489.JPG', 'IMG_0490.JPG', 'IMG_0491.JPG', 'IMG_0492.JPG', 'IMG_0494.JPG', 'IMG_0495.JPG'],
    '서산 베틀콩': ['20220325_132426.jpg', '20220325_132614.jpg', '20220325_132622.jpg', '20220325_140600.jpg', '20220325_140603.jpg', '20220325_143731.jpg', '20220325_143733.jpg', '20220325_143740.jpg', '20220325_143741.jpg', '20220325_143748.jpg', '20220325_143750.jpg', '20220325_143820.jpg', '20220325_143821.jpg', '20220325_143902.jpg', '20220325_145256.jpg', '20220325_145455.jpg', '20220325_151751.jpg', '20220325_151756.jpg'],
    '서산 생강': ['20200716_145559.jpg', '20200716_150035.jpg', '20200716_150046.jpg', '20200716_155447.jpg', '20200716_155846.jpg', '20200716_155854.jpg', '20200716_155903.jpg', '20200716_155906.jpg', '20200716_155910.jpg', '20200716_155920.jpg', '20200716_155927.jpg', '20200716_155949.jpg', '20200716_160051.jpg', '20200716_160118.jpg', '20200716_160125.jpg', '20200716_160644.jpg', '20200716_160709.jpg', '20210630_164147.jpg'],
    '순채': ['20201121_114455.jpg', '20201121_114457.jpg', '20201121_114515.jpg', '20201121_130919.jpg', '20201229_092237.jpg', '20230112_102511.jpg', '20230112_102518.jpg', '20230112_103900.jpg', '20230112_103914.jpg', '20230112_103948.jpg', '20230112_103957.jpg', '20230112_104023.jpg', '20230112_104520.jpg', '20230112_104530.jpg', '20230112_113601.jpg', '20230112_113825.jpg', '20230112_121700.jpg', '20230112_174719.jpg', '20230112_174731.jpg', '20230112_174951.jpg', '20230112_175141.jpg', '20230112_182246.jpg', '20230112_182842.jpg', '20230112_182920.jpg', '20230112_185634.jpg'],
    '예산오이': ['20200731_084533.jpg', '20200731_084538.jpg'],
    '울릉도': ['20210630_171531.jpg', '20210630_171547.jpg', '20210701_103244.jpg', '20210701_103250.jpg', '20210701_103459.jpg', '20210701_103535.jpg', '20210701_103547.jpg', '20210701_103742.jpg', '20210701_104149.jpg', '20210701_153617.jpg', '20210701_153629.jpg', '20210701_154551.jpg', '20210701_154603.jpg', '20210701_154652.jpg', '20210701_154755.jpg', '20210701_155627.jpg', '20210701_155637.jpg', '20210702_104516.jpg', '20210702_104525.jpg', '20210702_104635.jpg', '20210703_112330.jpg'],
    '울릉도 나리분지': ['DJI_0158.JPG', 'DJI_0159.JPG', 'DJI_0160.JPG', 'DJI_0161.JPG', 'DJI_0162.JPG', 'DJI_0163.JPG', 'DJI_0165.JPG', 'DJI_0166.JPG', 'DJI_0167.JPG', 'DJI_0177.JPG', 'DJI_0178.JPG', 'DJI_0179.JPG', 'DJI_0182.JPG', 'DJI_0183.JPG', 'DJI_0184.JPG', 'DJI_0185.JPG', 'DJI_0186.JPG', 'DJI_0191.JPG'],
    '이육사고추 산대리': ['1643971405242.jpg', '1643971406737.jpg', '1643971408181.jpg', '1643971409709.jpg', '20220204_111019.jpg', '20220204_111404.jpg', '20220204_111730.jpg'],
    '장씨네 오이': ['20200711_170434.jpg', '20200711_170447.jpg', '20200711_170451.jpg', '20200711_170510.jpg', '20200711_170525.jpg'],
    '제주 감저': ['20200213_104925.jpg', '20200213_105340.jpg', '20200213_105412.jpg', '20200213_114226.jpg', '20200213_120507.jpg', '20200213_120516.jpg', '20200213_120524.jpg', '20200213_120535.jpg', '20200213_120542.jpg', '20200213_120639.jpg', '20200213_121312.jpg', '20200213_121539.jpg', '20200213_121604.jpg', '20200213_121620.jpg', '20200213_121626.jpg', '20200213_121637.jpg', '20200213_121658.jpg', '20200213_122049.jpg', '20200213_122117.jpg', '20200213_122141.jpg', '20200213_122157.jpg', '20200213_122331.jpg', '20200213_122339.jpg', '20200213_122418.jpg', '20200213_122419.jpg', '20200213_123355.jpg', '20200213_123532.jpg', '20200213_123625.jpg', '20200213_132455.jpg', '20200213_132524.jpg', '20200213_132532.jpg', '20200213_132557.jpg', '20200213_132602.jpg', '20200213_132605.jpg', '20200213_132614.jpg', '20200213_132837.jpg', '20200213_132936.jpg', '20200213_132945.jpg', '20200213_132952.jpg'],
    '제주 도난조': ['20200731_064009.jpg', '20200915_155431.jpg', '20200915_161127.jpg', '20200915_161138.jpg', '20200915_162731.jpg', '20200915_162818.jpg', '20200915_162826.jpg', '20200915_162833.jpg', '20200915_162849.jpg', '20200915_162900.jpg', '20200915_162957.jpg', '20200917_140858.jpg', '20200917_141112.jpg', '20200917_144338.jpg'],
    '제주 메밀': ['20200213_142205.jpg', '20200213_143614.jpg', '20200213_150529.jpg', '20200213_151355.jpg', '20200213_151402.jpg', '20200213_151420.jpg', '20200213_151423.jpg', '20200213_151439.jpg', '20200213_151445.jpg', '20200213_151526.jpg', '20200213_151601.jpg', '20200213_151609.jpg', '20200213_151614.jpg', '20200213_151748.jpg', '20200213_151951.jpg', '20200213_151954.jpg', '20200213_151955.jpg', '20200213_152040.jpg', '20200213_152446.jpg', '20200213_152448.jpg', '20200213_152451.jpg', '20200213_153034.jpg', '20200213_173301.jpg', '20200213_180648.jpg', '20200213_180722.jpg'],
    '제주 조': ['20200915_161858.jpg', '20200915_161910.jpg', '20200915_162756.jpg', '20200915_162802.jpg', '20200915_162930.jpg', '20200915_162953.jpg', '20200915_163016.jpg', '20200915_163058.jpg', '20200915_163114.jpg', '20200915_163135.jpg', '20200915_163241.jpg', '20200915_163256.jpg', '20200915_163525.jpg', '20200915_163531.jpg', '20200915_163549.jpg', '20200915_163601.jpg', '20200915_163630.jpg', '20200915_163707.jpg', '20200915_164727.jpg', '20200915_175851.jpg', '20200915_180105.jpg', '20200915_180111.jpg'],
    '쥐눈이콩': ['20200816_080922.jpg', '20200816_081015.jpg', '20200816_081049.jpg', '20200816_081111.jpg', '20200816_081121.jpg', '20200816_094759.jpg', '20200816_094818.jpg', '20200816_094842.jpg', '20200816_094927.jpg', '20200816_094959.jpg', '20200817_182111.jpg', '20200817_182300.jpg', '20200817_182338.jpg', '20200817_182956.jpg', '20200817_183042.jpg', '20200817_183145.jpg', '20200821_074641.jpg', '20200821_074652.jpg', '20200821_074653.jpg', '20200821_074708.jpg', '20200821_074723.jpg', '20200821_074724.jpg', '20200821_074741.jpg', '20200821_075123.jpg', '20200821_075129.jpg', '20200821_080019.jpg', '20200821_080027.jpg', '20200821_080149.jpg', '20200821_080356.jpg', '20200821_080401.jpg', '20200821_080542.jpg', '20200901_141450.jpg'],
    '진주 벗들무': ['20210123_140337.jpg', '20210123_140508.jpg', '20210123_140521.jpg', '20210123_144646.jpg', '20230902_114534.jpg', '20230902_114539.jpg', '20230902_115022.jpg', '20230902_115026.jpg', '20230902_115245.jpg', '20230902_115247.jpg', '20230902_115256.jpg'],
    '진주 수집': ['20201121_131747.jpg', '20210123_132349.jpg', '20210123_132417.jpg', '20210123_140029.jpg', '20210123_140337.jpg', '20210123_140508.jpg', '20210123_142950.jpg', '20210123_143814.jpg', '20210123_143902.jpg', '20210123_143925.jpg', '20210123_143939.jpg', '20210123_144032.jpg', '20210123_144035.jpg', '20210123_144038.jpg', '20210123_144517.jpg', '20210123_144529.jpg', '20210123_144646.jpg', '20210123_144709.jpg', '20210319_140732.jpg'],
    '진주대평 수집': ['20210524_164630.jpg', '20210524_172625.jpg', '20210524_172720.jpg', '20210524_172811.jpg', '20210524_172829.jpg', '20210524_172848.jpg', '20210524_172859.jpg', '20210524_173158.jpg', '20210524_173200.jpg', '20210524_174157.jpg', '20210524_174207.jpg', '20210524_174218.jpg', '20210524_174237.jpg', '20210525_071411.jpg', '20210525_071419.jpg', '20210525_071421.jpg', '20210525_071659.jpg', '20210525_074403.jpg', '20210525_074405.jpg', '20210525_081440.jpg', '20210525_081450.jpg', '20210525_081745.jpg', '20210525_081811.jpg', '20210525_081822.jpg', '20210525_082033.jpg'],
    '포천': ['004.JPG', '006.JPG', '008.JPG', '009.JPG', '010.JPG', '011.JPG', '012.JPG', '013.JPG', '014.JPG', '016.JPG', '017.JPG', '021.JPG', '022.JPG', '023.JPG', '024.JPG', '028.JPG', '030.JPG', '031.JPG', '032.JPG', '033.JPG', '034.JPG', '038.JPG', '040.JPG', '041.JPG', '042.JPG', '043.JPG'],
    '포천선비잡이콩': ['20200508_142142.jpg', '20200508_142145.jpg', '20200508_142151.jpg', '20200508_142156.jpg', '20200508_142200.jpg', '20200508_142206.jpg', '20200508_142208.jpg', '20200508_142212.jpg', '20200508_142224.jpg', '20200508_142226.jpg', '20200508_142244.jpg', '20200508_142252.jpg', '20200508_142301.jpg', '20200508_193246.jpg', '20200508_193424.jpg', '20200508_193430.jpg', '20200508_193529.jpg', '20200508_194610.jpg', '20200508_194625.jpg', '20200509_103951.jpg'],
    '포천팥 부룩뻬기': ['20200508_115212.jpg', '20200508_120202.jpg', '20200508_120205.jpg', '20200508_121409.jpg', '20200508_121618.jpg', '20200508_121619.jpg', '20200508_122450.jpg'],
    '하동잭설차': ['0210629_093452.jpg', '0210629_093454.jpg', '0210629_093509.jpg', '0210629_103004.jpg', '0210629_103103.jpg', '0210629_113746.jpg', '0210629_113817.jpg', '0210629_114055.jpg', '0210629_114137.jpg', '0210629_114635.jpg', '0210629_114703.jpg', '0210629_141920.jpg', '0210630_163554.jpg', '0210630_163649.jpg'],
    '홀아비밤콩': ['20200508_101600.jpg', '20200508_101705.jpg', '20200508_102356.jpg', '20200508_102433.jpg', '20200508_102610.jpg', '20200508_102636.jpg', '20200508_102703.jpg', '20200508_103738.jpg', '20200508_103755.jpg', '20200508_104428.jpg', '20200508_110542.jpg', 'IMG_0289.JPG', 'IMG_0290.JPG', 'IMG_0291.JPG', 'IMG_0294.JPG'],
    '홍감자': ['20210630_163315.jpg', '20210630_171314.jpg', '20210630_171334.jpg', '20210630_171336.jpg', '20210630_171405.jpg', '20210630_171525.jpg', '20210630_171533.jpg', '20210701_081848.jpg', '20210701_103316.jpg', '20210701_103356.jpg', '20210701_153625.jpg', 'DJI_0142.JPG', 'DJI_0144.JPG', 'DJI_0150.JPG', 'DJI_0155.JPG', 'DJI_0157.JPG'],
}

const SeedStory = () => {
    const navigate = useNavigate();
    const [mainTab, setMainTab] = useState(0);

    const handleMainTabChange = (_: React.SyntheticEvent, newValue: number) => {
        setMainTab(newValue);
    };

    useEffect(() => {
        window.scrollTo(0, 0);
    }, []);

    const Exhibit1 = () => {
        const stories = [
            {'title': '100세 어머니의 노아의 방주 속에서 찾아낸 참깨', body: '1.pdf'},
            {'title': '백제울 ‘씨토쟁이’ 정근형의 쥐눈이콩', body: '2.pdf'},
            {'title': '자린고비 ‘장호생이 닮은 놈‘이 지킨 오이', body: '3.pdf'},
            {'title': '추사가 사랑했던 서산의 생강', body: '4.pdf'},
            {'title': '장마 홍수 속에서 건져낸 씨종자, 울릉도 황금 옥수수 (울릉도 토종 수집기 (1))', body: '5.pdf'},
            {'title': '부끄러워 감춰버린 홍감자를 찾아라. (울릉도 토종씨앗 수집기 (2))', body: '6.pdf'},
            {'title': '종콩밥이 웬수여, 묘순이의 살인사건에 연루된 종콩', body: '7.pdf'},
            {'title': '곰태곤이 쓰러지자 나타난 돌동부', body: '8.pdf'},
            {'title': '짐을 버려야 사는 1.4 후퇴, 그리고 봇짐 속의 감참외', body: '9.pdf'},
            {'title': '비주류들이 지켜낸 마늘, 가의도 육 쪽 마늘', body: '10.pdf'},
            {'title': '김숙자 할머니의 회한의 토종 텃밭', body: '11.pdf'},
            {'title': '마루 틈새에 남아있는 부룩빼기 그루팥 두 알', body: '12.pdf'},
            {'title': '베틀콩 할머니, 시장을 장악하다. 단골들이 지켜낸 베틀콩', body: '13.pdf'},
            {'title': '메밀꽃 무렵에 없어진 토종 메밀', body: '14.pdf'},
            {'title': '화려한 제주 방언의 마법사, 조', body: '15.pdf'},
            {'title': '그는 내게로 와서 꽃이 되었다. 구억배추', body: '16.pdf'},
            {'title': '감저, 제주도를 닮다.', body: '17.pdf'},
            {'title': '하동의 야생차는 작설이 아니라 ‘잭설’이다.', body: '18.pdf'},
            {'title': '조선의 두유, 세모승. 하나가리 콩을 지키는 사람들 ', body: '19.pdf'},
            {'title': '정감록의 신념이 지켜낸 토종 밀', body: '20.pdf'},
            {'title': '홀아비 밤콩은 그리움이다.', body: '21.pdf'},
            {'title': '가마와 함께 시집온 씨앗 세 알, 연지동제의 멋쩍은 웃음을 닮은 정 할머니', body: '22.pdf'},
            {'title': '자연이 지키고 있는 산청에서 온 의성배추', body: '23.pdf'},
            {'title': '집성촌에서 지켜낸 씨, 성환 개구리참외', body: '24.pdf'},
            {'title': '집성촌에서 지켜낸 씨, 성환 개구리참외', body: '25.pdf'},
            {'title': '설렘이 세 번이면 그것은 사랑이 된다. 이육사 고추', body: '26.pdf'},
            {'title': '지독한 농사꾼을 만나 정체성을 바꿔버린 매꼬지 상추', body: '27.pdf'},
            {'title': '만리포 사랑, 백도라지에 공들인 자식 사랑', body: '28.pdf'},
            {'title': '애오라지 정선의 삶, 김종복 할아버지의 단미콩', body: '29.pdf'},
            {'title': '너와 지붕에서 지켜낸 백두산 최 씨 일가의 대파 이야기', body: '30.pdf'},
            {'title': '지못미, 돌산갓 뒤에 숨어 버린 토종 돌산갓', body: '31.pdf'},
            {'title': '지못미 자광벼, 마지막 토종벼의 이삭 한 터럭', body: '32.pdf'},
            {'title': '지못미, 순채. 30년 된 순채 순 하나 얻다. 끝내 지켜내지 못한 예산의 순채', body: '33.pdf'},


        ];

        return (
            <Paper elevation={3} sx={{ p: 4, borderRadius: 2 }}>
                <Box
                    sx={{
                        display: 'flex', // Flexbox 레이아웃 적용
                        flexDirection: { xs: 'column', md: 'row' },
                        gap: 4, // Box 간 간격
                    }}
                >
                    {/* 왼쪽: 책 이미지 */}
                    <Box
                        component="img"
                        src="/seedStory/book.png"
                        alt="책 이미지"
                        sx={{
                            width: { xs: '100%', md: 400 },
                            height: { xs: 'auto', md: 600 },
                            borderRadius: 2,
                            boxShadow: 3,
                        }}
                    />

                    {/* 오른쪽: 이야기 리스트 */}
                    <Box
                        sx={{
                            flex: 1,
                            display: 'flex',
                            flexDirection: 'column',
                            gap: 1.5,
                        }}
                    >
                        {stories.map((story, index) => (
                            <Accordion key={index} sx={{ mb: 1 }}>
                                <AccordionSummary
                                    expandIcon={<NavigateNextIcon />}
                                    aria-controls={`panel${index}-content`}
                                    id={`panel${index}-header`}
                                    onClick={() => window.open(`/seedStory/${story.body}`, '_blank')}
                                >
                                    <Typography>{story.title}</Typography>
                                </AccordionSummary>
                            </Accordion>
                        ))}
                    </Box>
                </Box>
            </Paper>
        )
    };

    const Exhibit2 = () => {
        const stories = [
            {'title': '구만리 포구의 사라져가는 디미방, 덤벙김치', body: '100.pdf'},
            {'title': '금치리의 썩은 김치를 잇고 있는 할머니들의 디미방', body: '101.pdf'},
            {'title': '대천리 마실 놀이와 그늘장', body: '102.pdf'},
            {'title': '복놀이와 변해가는 어죽의 디미방', body: '103.pdf'},
            {'title': '사라진 백제, 사라진 놀이, 공마당 놀이', body: '104.pdf'},
            {'title': '시목리의 숨겨징 디미방 맨간장', body: '105.pdf'},
            {'title': '식탐의 군침이 속절없이 흐르는 생강의 디미방', body: '106.pdf'},
            {'title': '예산읍 대회리의 상여 놀이와 으름음식', body: '107.pdf'},
            {'title': '조선시대 컬러푸드의 진수가 남아 있는 음청(飮淸) 디미방, 청보리 수단', body: '108.pdf'},
            {'title': '환경에 밀려 사라진 삽교 순채 디미방', body: '109.pdf'},
        ];

        return (
            <Paper elevation={3} sx={{ p: 4, borderRadius: 2 }}>
                <Box
                    sx={{
                        display: 'flex', // Flexbox 레이아웃 적용
                        flexDirection: { xs: 'column', md: 'row' },
                        gap: 4, // Box 간 간격
                    }}
                >
                    <Box
                        sx={{
                            flex: 1,
                            display: 'flex',
                            flexDirection: 'column',
                            gap: 1.5,
                        }}
                    >
                        {stories.map((story, index) => (
                            <Accordion key={index} sx={{ mb: 1 }}>
                                <AccordionSummary
                                    expandIcon={<NavigateNextIcon />}
                                    aria-controls={`panel${index}-content`}
                                    id={`panel${index}-header`}
                                    onClick={() => window.open(`/seedStory/${story.body}`, '_blank')}
                                >
                                    <Typography>{story.title}</Typography>
                                </AccordionSummary>
                            </Accordion>
                        ))}
                    </Box>
                </Box>
            </Paper>
        )
    };

    const Exhibit3 = () => {
        return (
            <Paper elevation={3} sx={{ p: 4, borderRadius: 2 }}>
                <Box
                    sx={{
                        display: 'flex', // Flexbox 레이아웃 적용
                        flexDirection: { xs: 'column', md: 'row' },
                        gap: 4, // Box 간 간격
                    }}
                >
                    <Box
                        sx={{
                            display: 'flex',
                            flexDirection: 'column',
                            gap: 1.5,
                            width: '100%'
                        }}
                    >
                        {/* 이미지 리스트 반복 */}
                        {Object.entries(imageList).map(([title, images], index) => (
                            <Accordion key={index} sx={{ mb: 1 }}>
                                <AccordionSummary
                                    expandIcon={<NavigateNextIcon />}
                                    aria-controls={`panel${index}-content`}
                                    id={`panel${index}-header`}
                                >
                                    <Typography sx={{ fontWeight: 'bold' }}>{title}</Typography>
                                </AccordionSummary>
                                <AccordionDetails
                                    sx={{
                                        padding: 0,       // padding 제거
                                    }}
                                >
                                    {/* 이미지 리스트 가로 한 줄로 출력 */}
                                    <Box
                                        sx={{
                                            display: 'flex',
                                            flexDirection: 'row',
                                            gap: 2, // 이미지 간 간격
                                            overflowX: 'auto', // 이미지들이 부모를 초과하면 가로 스크롤 적용
                                            padding: 2, // 공간 확보
                                            width: { xs: '80%', sm: '90%', md: '94%' },
                                        }}
                                    >
                                        {images.map((image, imgIndex) => (
                                            <Box
                                                key={imgIndex}
                                                sx={{
                                                    height: 300,
                                                    width: 300,
                                                    objectFit: 'cover',
                                                    boxShadow: 3,
                                                    flexShrink: 0,
                                                    borderRadius: 2,
                                                    overflow: 'hidden',
                                                    cursor: 'pointer',
                                                }}
                                            >
                                                <a
                                                    href={`/seedStory/pic/${title}/${image}`} // 원본 이미지 경로
                                                    target="_blank" // 새 탭에서 열기
                                                    rel="noopener noreferrer" // 보안 속성 추가
                                                    style={{ textDecoration: 'none' }} // 기본 링크 스타일 제거
                                                >
                                                    <Box
                                                        component="img"
                                                        src={`/seedStory/pic/${title}/${image}`}
                                                        alt={image}
                                                        sx={{
                                                            height: '100%',
                                                            width: '100%',
                                                            objectFit: 'cover',
                                                        }}
                                                    />
                                                </a>
                                            </Box>
                                        ))}
                                    </Box>
                                </AccordionDetails>
                            </Accordion>
                        ))}
                    </Box>
                </Box>
            </Paper>
        );
    };

    const breadcrumbs = [
        <Link underline="hover" key="1" color="inherit" href="/seed/" onClick={() => {
            navigate('/seed/');
        }}>
            Home
        </Link>,
        <Typography key="2" sx={{color: 'text.primary'}}>
        씨앗이야기
        </Typography>,
    ];

    return (
        <Box sx={{ p: 2 }}>
            <Stack spacing={2}>
                <Breadcrumbs
                    separator={<NavigateNextIcon fontSize="small" />}
                    aria-label="breadcrumb"
                >
                    {breadcrumbs}
                </Breadcrumbs>
            </Stack>

            <Box sx={{ pt: 3 }}>
                <Typography
                    variant="h4"
                    component="h1"
                    gutterBottom
                    sx={{ fontWeight: 'bold' }}
                >
                    씨앗이야기
                </Typography>
                <Divider sx={{ mt: 3, borderBottomWidth: 3, bgcolor: 'black' }} />
            </Box>

            <Box sx={{ p: 3 }}>
                {/* 상위 탭 */}
                <Tabs
                    value={mainTab}
                    onChange={handleMainTabChange}
                    centered
                >
                    <Tab label="수집 이야기 - 책 이야기" />
                    <Tab label="수집 이야기 - 음식 이야기" />
                    <Tab label="수집 이야기 - 수집 사진" />
                </Tabs>
                <Box sx={{ mt: 2 }}>
                    {mainTab === 0 && <Exhibit1 />}
                    {mainTab === 1 && <Exhibit2 />}
                    {mainTab === 2 && <Exhibit3 />}
                </Box>
            </Box>
        </Box>
    );
};

export default SeedStory;