import React, {useMemo, useState} from 'react';

import {
    Box,
    Breadcrumbs,
    Checkbox,
    Divider,
    FormControlLabel,
    FormGroup,
    Link,
    Pagination,
    Stack,
    Typography,
} from "@mui/material";
import NavigateNextIcon from '@mui/icons-material/NavigateNext';
import {useNavigate} from "react-router-dom";


const imageList: { [key: string]: string[] } = {
    '01': ['2. 장기벼 (1).JPG', '3. 적토미 (1).JPG', '4. 대추도 (4).JPG', '가마다.jpg', '가산벼.jpg', '가산벼2016-05-01-14-00-18.jpg', '가오리2016-05-01-13-58-20.jpg', '가오리20160704_092908.jpg', '가오리벼.jpg', '가위찰.jpg', '가위찰2016-05-01-14-10-54.jpg', '가위찰20160808_170250.jpg', '각시벼.jpg', '각시점조2016-05-01-14-07-11.jpg', '각씨나2016-05-01-14-03-13.jpg', '강도도.jpg', '강도도2016-05-01-14-05-09.jpg', '강릉도.jpg', '강릉도2016-05-01-13-59-21.jpg', '강릉도_20160808_112627.jpg', '강릉도_20160808_155347.jpg', '강배도.jpg', '강배도2016-05-01-13-51-17.jpg', '강배도2016-05-01-14-04-15.jpg', '객주조도2016-05-01-14-06-08.jpg', '객주찰.jpg', '검정쌀2016-05-01-13-09-01.jpg', '경기연천수집벼2016-05-01-13-12-40.jpg', '괴산찰20160808_170441.jpg', '구릉찰20160808_105916.jpg', '구안도_20160808_155122.jpg', '구중도.jpg', '구중도99-2016-05-01-13-53-11.jpg', '구증도2016-05-01-13-52-15.jpg', '구천도.jpg', '구천도2016-05-01-13-48-14.jpg', '권조나_20160808_105412.jpg', '궐나도20160808_163610.jpg', '금도_20160808_105007.jpg', '김포돼지찰.jpg', '까투리찰.jpg', '깨벼.jpg', '깨벼2016-05-01-14-01-10.jpg', '깨벼20160704_092151.jpg', '나미_20160808_110313.jpg', '냉도.jpg', '냉도13.jpg', '냉도2016-05-01-13-50-15.jpg', '냉도2016-05-01-14-02-17.jpg', '냉도도.jpg', '냉수도2016-05-01-13-54-07.jpg', '노인다리 (2).jpg', '노인다리.jpg', '노인다리2016-05-01-13-56-43.jpg', '노인도.jpg', '노인도2016-05-01-13-54-59.jpg', '노인조.jpg', '노인조2016-05-01-13-49-06.jpg', '녹두도2016-05-01-13-55-52 (1).jpg', '녹두도2016-05-01-13-55-52.jpg', '녹미.jpg', '다다조.jpg', '다마금20160808_170820.jpg', '다마금_20160808_113418.jpg', '단두나_20160808_112411.jpg', '달곳못_20160808_104529.jpg', '대골도2016-05-01-13-47-02.jpg', '대관도.jpg', '대관도2016-05-01-13-46-02.jpg', '대관도20160704_092044.jpg', '대관도_20160808_112845.jpg', '대구나.jpg', '대구나2016-05-01-13-44-59.jpg', '대궐도.jpg', '대조나20160808_160627.jpg', '대조도 (2).jpg', '대조도.jpg', '대지찰.jpg', '대지찰2016-05-01-13-31-19.jpg', '대추찰.jpg', '대춘도20160808_162255.jpg', '덕적조도.jpg', '덕적조도2016-05-01-13-44-01.jpg', '돈나_20160808_111845.jpg', '돈나_20160808_113631.jpg', '동산조_20160808_110936.jpg', '돼지찰.jpg', '돼지찰20160808_170116.jpg', '돼지찰_2016-05-01-13-07-59.jpg', '드렁치기20160704_092539.jpg', '들렁치기벼.jpg', '들렁치기벼2016-05-01-13-42-48.jpg', '땅벼.jpg', '땅벼2016-05-01-13-36-47.jpg', '땅벼20160704_093056.jpg', '땅조 (2).jpg', '땅조.jpg', '땅조2016-05-01-13-37-58.jpg', '모도_20160808_104800.jpg', '뫼산디20160808_162027.jpg', '바람둥구리.jpg', '바람둥구리2016-05-01-13-39-05.jpg', '바람둥구리20160704_093308.jpg', '반달벼2016-05-10-08-28-21.jpg', '밭찰벼_20160808_154239.jpg', '백경조_20160808_112205.jpg', '백곡나 (2).jpg', '백곡나.jpg', '백곡나2-2016-05-01-13-40-12.jpg', '백곡나2016-05-01-13-41-48.jpg', '백곡나20160704_093158 (1).jpg', '백도_20160808_113814.jpg', '버들벼.jpg', '벼_검정쌀20160704_091751.jpg', '벼_밭찰벼20170521_151302.jpg', '벼_자광벼.jpeg', '벼꽃 (1).jpg', '벼꽃 (2).jpg', '병옥20160808_164258.jpg', '북흑조.jpg', '북흑조2016-05-01-13-10-03.jpg', '불도_20160808_103641.jpg', '불도_20160808_112026.jpg', '붉은 찰벼.jpg', '붉은찰벼2016-05-01-13-11-01.jpg', '붉은찰벼20160808_155551.jpg', '비단찰.jpg', '사상조_20160808_111333.jpg', '산도20160808_170629.jpg', '소요오리20160808_114009.jpg', '쇠머리지장.jpg', '쇠머리지장20160704_092959.jpg', '쇠머리지장_2016-05-01-13-04-02.jpg', '수원조.jpg', '수원조_2016-05-01-13-02-41.jpg', '숙나_2016-05-01-12-59-35.jpg', '쌀벼_20160808_160453.jpg', '쑤벼.jpg', '쑤벼20160704_092747.jpg', '쑤벼_2016-05-01-13-01-31 (1).jpg', '쓴데기.jpg', '쓴데기2016-05-01-14-15-06.jpg', '쓴데기20160704_092315.jpg', '아가벼.jpg', '아가벼2016-05-01-14-14-12.jpg', '아꾸디찰20160808_105701.jpg', '앉은뱅이벼.jpg', '앵미.jpg', '앵미2016-05-01-14-13-13.jpg', '영품찰.jpg', '오름벼20160808_163755.jpg', '옥경20160808_154028.jpg', '옥천재래 돼지찰.jpg', '올못개_20160808_113217.jpg', '왜조찰20160808_103045.jpg', '왜조찰_20160808_103045.jpg', '요남도_20160808_111133.jpg', '용천.jpg', '용천2016-05-01-14-16-07.jpg', '원조_20160808_161429.jpg', '유나_20160808_104109.jpg', '유전자원113933-2016-05-01-13-35-15.jpg', '유전자원114080-2016-05-01-13-34-03.jpg', '이웃모르기_20160808_103311.jpg', '일반찰벼_20160808_154624.jpg', '자광도2016-05-01-13-30-13.jpg', '자광도_20160808_153825.jpg', '자광벼.jpeg', '자광벼.jpg', '자나_20160808_105212.jpg', '잔모찰20160808_163252.jpg', '장다다기.jpg', '장삼도.jpg', '장삼도2016-05-01-14-17-03.jpg', '재래조도.jpg', '재래조도2016-05-01-13-28-11.jpg', '적도2016-05-01-13-27-08.jpg', '점도_20160808_110455.jpg', '점조_20160808_110121.jpg', '조동지 (2).jpg', '조동지.jpg', '조동지2016-05-01-13-24-35.jpg', '조생도_20160808_154929.jpg', '조슬비찰2016-05-01-13-29-09.jpg', '족제비찰.jpg', '족제비찰20160808_162508.jpg', '족제비찰_20160808_103853.jpg', '쥐이파리벼.jpg', '쥐이파리벼20160704_093838.jpg', '쥐잎파리벼2016-05-01-13-25-45.jpg', '진나20160808_163038.jpg', '진화.jpg', '진화2016-05-01-13-23-35.jpg', '쫄장벼.jpg', '차나락.jpg', '차나락2016-05-01-13-22-04.jpg', '찰벼20160808_163900.jpg', '찰벼_20160808_155802.jpg', '창원재래_20160808_154420.jpg', '천방사복장유물벼_20160704_093723.jpg', '천주도20160808_161837.jpg', '천주도_20160808_111625.jpg', '천주도_20160808_161837.jpg', '청미2016-05-01-13-06-57.jpg', '청송도_20160808_160848.jpg', '칠찰벼_20160808_104337.jpg', '파주수집벼_2016-05-01-13-05-30.jpg', '팥벼20160808_165948.jpg', '평북 4_20160808_160238.jpg', '포천유망찰.jpg', '포천유망찰2016-05-01-14-08-30.jpg', '포천장망메벼.jpg', '포천장망메벼2016-05-01-13-21-01.jpg', '한양조 (2).jpg', '한양조.jpg', '한양조2016-05-01-13-16-01.jpg', '한양조20160704_091944.jpg', '해조_20160808_113037.jpg', '향도2016-05-01-13-32-18.jpg', '홍두나20160808_110639.jpg', '홍색나20160808_164020.jpg', '화도_20160808_160024.jpg', '황조2016-05-01-13-20-02.jpg', '황토도_20160808_153425.jpg', '후리나_20160808_161054.jpg', '흑대구.jpg', '흑대구2016-05-01-13-16-58.jpg', '흑대구20160704_092437.jpg', '흑미.jpg', '흑미2016-05-01-13-13-53.jpg', '흑발_20160808_161605.jpg', '흑색도2016-05-01-14-11-52.jpg', '흑연진도_20160808_160627.jpg'],
    '02': ['보리_가을보리20160704_113451.jpg', '보리_늘보리_2016-05-01-10-58-19.jpg', '보리_대전육각20160704_110127.jpg', '보리_대천과맥_2016-05-01-10-28-57.jpg', '보리_대천피맥4_2016-05-01-10-50-51.jpg', '보리_대천피맥_2016-05-01-11-06-06.jpg', '보리_동보리_2016-05-01-11-09-16.jpg', '보리_백동20160704_110200.jpg', '보리_백동_2016-05-01-09-51-57.jpg', '보리_성환경기과맥3_2016-05-01-11-15-06.jpg', '보리_수원재래2_2016-05-01-10-33-27.jpg', '보리_아산찐보리_2016-05-01-11-01-10.jpg', '보리_예산피맥2_2016-05-01-11-12-05.jpg', '보리_예산피맥5_2016-05-01-10-43-30.jpg', '보리_예산피맥_2016-05-01-11-02-50.jpg', '보리_온양동보리_2016-05-01-10-27-24.jpg', '보리_온양찐보리_2016-05-01-10-55-10.jpg', '보리_온양피맥2_2016-05-01-10-31-54.jpg', '보리_육각맥20160704_110056.jpg', '보리_육각맥_2016-05-01-11-13-24.jpg', '보리_읍포피맥20160501_094717.jpg', '보리_장망_2016-05-01-09-53-14.jpg', '보리_장항피맥3_2016-05-01-10-40-10.jpg', '보리_조치원동보리_2016-05-01-10-53-42.jpg', '보리_조치원피맥2_2016-05-01-10-36-29.jpg', '보리_죽림2호_2016-05-01-10-44-59.jpg', '보리_찐보리20160501_094403.jpg', '보리_찰보리20170521_142455.jpg', '보리_천방사복장유물4호20160704_113413 (1).jpg', '보리_천안피맥20160501_094545.jpg', '보리_청보리20170521_143554.jpg', '보리_청양백동2_2016-05-01-10-46-33.jpg', '보리_청양피맥4_2016-05-01-09-54-48.jpg', '보리_청양피맥7_2016-05-01-10-49-05.jpg', '보리_청양피맥8_2016-05-01-11-07-44.jpg', '보리_청양피맥_2016-05-01-09-49-45.jpg', '보리_태안동보리_2016-05-01-10-41-37.jpg', '보리_합덕찐보리_2016-05-01-10-59-48.jpg', '보리_해미 동보리20160501.jpg', '보리_해미대전 육각 2-2016-05-01-10-30-24.jpg', '보리_해미피맥3_2016-05-01-10-38-16 (1).jpg', '보리_해미피맥3_2016-05-01-10-38-16.jpg', '보리_해미피맥4_2016-05-01-10-35-06.jpg', '보리_해미피맥5_2016-05-01-10-52-16.jpg', '보리_해미피맥육각 보리20160501.jpg', '보리_홍성재래_2016-05-01-09-56-19.jpg'],
    '03': ['밀.jpg', '밀_ 남해밀 (1).JPG', '밀_거창_참밀20170521_134401.jpg', '밀_앉은뱅이밀-남해 (1).jpg', '밀_앉은뱅이밀-남해 (2).jpg', '밀_예천참밀20170521_142630.jpg', '밀_진주_앉은뱅이밀2016-05-03-17-54-25.jpg', '호밀_영월2016-05-03-11-36-50.jpg'],
    '04': ['강낭_갈매기양대20170521_153630.jpg', '강낭_검은제비콩2016-05-03-13-23-17.jpg', '강낭_넝쿨강낭2016-05-03-14-08-09.jpg', '강낭_덩쿨콩20170521_151210.jpg', '강낭_두벌강낭콩2016-05-03-13-14-18.jpg', '강낭_둥근울양대20170521_144947.jpg', '강낭_양산_울양대20170521_152737.jpg', '강낭_얘산2016-05-05-15-04-42.jpg', '강낭_얼룩줄콩20170521_134554.jpg', '강낭_얼룩키작은 강낭콩2016-05-03-14-09-42.jpg', '강낭_예산_강낭콩20170521_132806.jpg', '강낭_작두콩2016-05-03-13-19-21.jpg', '강낭_화성_검은제비20160704_095340.jpg', '강낭_흰제비콩2016-05-03-13-18-01.jpg', '강낭콩_20170521_132426.jpg', '동부-평창-적색동부20160704_094239.jpg', '동부_.갓끈동부.jpg', '동부_각시동부.jpg', '동부_각씨동부2016-05-03-13-38-09.jpg', '동부_갓끈동부 (4).JPG', '동부_갓끈동부20170418_163010.jpg', '동부_갓끈동부_2016-05-03-13-20-27.jpg', '동부_밀양_재래동부2016-05-10-11-45-41.jpg', '동부_어금니동부2016-05-03-13-36-02.jpg', '동부_어금니동부20170418_162416.jpg', '동부_에산-적색동부2016-05-18-18-48-05.jpg', '동부_예산_개파리20170418_162506.jpg', '동부_작은어금닉동부20170521_153544.jpg', '동부_청원_재래동부20160704_094547.jpg', '동부_킹콩덩쿨동부2016-05-03-14-28-20.jpg', '동부_화성갓끈동부2016-05-03-14-34-47.jpg', '동부_흰동부20170521_140709.jpg', '콩-포천호래비방콩2016-05-03-14-40-39.jpg', '콩_ 부채콩.jpg', '콩_검은나물콩20170521_133710.jpg', '콩_검정콩20170521_134917.jpg', '콩_굵은콩20170521_142235.jpg', '콩_납데기콩20170418_160352.jpg', '콩_납지랭이콩20160704_094701.jpg', '콩_노랑줄줄이콩나물콩2016-05-10-10-23-30.jpg', '콩_대술_서리태2016-05-06-06-55-35.jpg', '콩_대추방콩20170418_160945.jpg', '콩_득지기오리알태20170418_160236.jpg', '콩_득지기콩20170418_154744.jpg', '콩_머루콩20160704_094027.jpg', '콩_복어콩2016-05-03-14-29-37.jpg', '콩_복어콩20160704_095435.jpg', '콩_복어콩20170521_133433.jpg', '콩_봉화-한아가리콩2016-05-03-17-51-54.jpg', '콩_부석태20170521_150021.jpg', '콩_부억다리콩20170521_1458.jpg', '콩_부채콩.JPG', '콩_부채콩20170418_160527.jpg', '콩_분홍칼콩2016-05-03-18-05-14.jpg', '콩_새알콩20160704_112327.jpg', '콩_새알콩4.jpg', '콩_선비잡이콩20170418_161429.jpg', '콩_선비콩20170418_153905.jpg', '콩_속청방콩20170418_160030.jpg', '콩_속청서리태20170521_132533.jpg', '콩_속청콩20170521_135428.jpg', '콩_아주가리방콩20170418_161752.jpg', '콩_아주까리밤콩 (3).JPG', '콩_안면도_새알콩2016-05-18-18-42-02.jpg', '콩_야생_납데기콩2016-05-10-08-21-02.jpg', '콩_에산_굵은콩20170521_144249.jpg', '콩_예산_40일콩2016-05-10-16-05-57.jpg', '콩_예산_조선콩2016-05-05-15-07-16.jpg', '콩_예산메주콩20170521_143022.jpg', '콩_오가피콩.JPG', '콩_오리알태20170418_161550.jpg', '콩_유월태20170418_163720.jpg', '콩_장록올콩20170521_134448.jpg', '콩_조선콩20170418_152415.jpg', '콩_준저리2016-05-18-18-38-30.jpg', '콩_쥐눈이콩20170521_141331.jpg', '콩_천방사복장유물5 호20160704_112911.jpg', '콩_토종파랑콩20170418_152239.jpg', '콩_포천_늦서리태20170521_133212.jpg', '콩_포천_부채콩20160704_112444.jpg', '콩_포천_선비콩20160704_094125.jpg', '콩_포천_올서리태20170521_133257.jpg', '콩_포천_한아가리콩20160704_112327 (1).jpg', '콩_하얀콩20170521_153104.jpg', '콩_한아가리콩20170418_161230.jpg', '콩_화초콩20170521_152116.jpg', '콩_황금태20170521_151818.jpg', '콩_황태20170521_140505.jpg', '콩_흑태20170521_142804.jpg', '콩_흰방콩20170521_133623.jpg'],
    '05': ['수수_까만수수2016-05-03-10-46-19.jpg', '수수_까치수수2016-05-03-10-50-04.jpg', '수수_꼬부랑수수2016-05-03-10-51-10.jpg', '수수_꼬부랑수수20170418_151651.jpg', '수수_느르방맹이수수_2016-05-03-10-40-45.jpg', '수수_몽탁20170418_152802.jpg', '수수_몽탁수수2016-05-03-10-52-18.jpg', '수수_반원당2016-05-03-10-42-31.jpg', '수수_반월당20170418_152035.jpg', '수수_방망이수수20170521_144706 (1).jpg', '수수_빗자루수수2016-05-03-10-53-44.jpg', '수수_시경20170418_153247.jpg', '수수_시경수수2016-05-03-10-55-54.jpg', '수수_쌀수수.JPG', '수수_쌀수수20170521_151433.jpg', '수수_에산수수2016-05-03-10-54-51.jpg', '수수_잓목수수2016-05-03-10-47-39.jpg', '수수_장목20170418_155453.jpg', '수수_조사찰수수2016-05-03-10-43-52.jpg', '수수_조합수수2016-05-03-10-45-21.jpg', '수수_홍성 꼬불랑수수20170521_143109.jpg', '수수_홍성_장목수수2016-05-10-10-43-39.jpg', '옥수수_강원 찰옥수수.JPG', '옥수수_강원도_메옥수수20170521_143341.jpg', '옥수수_노랑옥수수20170521_144811.jpg', '옥수수_동해_검은찰옥수수2016-05-18-18-46-30.jpg', '옥수수_쉬강냉이20170521_142928.jpg', '옥수수_울릉도메옥수수2016-05-03-18-01-18.jpg', '옥수수_전의_검은찰옥수수016-05-10-08-25-14.jpg', '옥수수_전의_황금옥수수20170521_152257.jpg', '옥수수_쥐옥수수20170521_145517.jpg', '옥수수_팔줄배기2016-05-03-14-30-50.jpg', '옥수수_화성_늦찰옥수수2016-05-03-17-55-50.jpg'],
    '06': ['팥_가래팥20170521_152430.jpg', '팥_감탕골검은팥2016-05-05-14-48-30.jpg', '팥_그루팥20170521_135152.jpg', '팥_까치팥20170521_145558.jpg', '팥_봉산2016-05-05-15-10-18.jpg', '팥_봉산_적팥2016-05-08-07-11-58.jpg', '팥_봉화_적두20170521_134109.jpg', '팥_비진팥20170521_141015.jpg', '팥_새팥20170521_142406.jpg', '팥_시알팥2016-05-05-14-56-43.jpg', '팥_안면고2016-05-18-18-40-39.jpg', '팥_안면도적팥2016-05-18-18-39-42 (1).jpg', '팥_예산_빨강팥20170521_132710.jpg', '팥_예산_적두20170521_143819.jpg', '팥_예산_조선팥20170521_143424.jpg', '팥_예팥20170521_134639.jpg', '팥_재팥20170521_132626.jpg', '팥_적두팥20170521_141207.jpg', '팥_청양_앵두팥2016-05-03-14-43-27.jpg', '팥_포천_적재팥2016-05-03-17-57-05.jpg', '팥_흰팥20170521_141512.jpg'],
    '07': ['녹두_경기재래2016-05-03-11-02-42.jpg', '녹두_경북재래2016-05-03-11-01-28.jpg', '녹두_경북재래20160704_102343.jpg', '녹두_고립녹두2016-05-03-11-00-11.jpg', '녹두_고립녹두20160704_102249.jpg', '녹두_고립녹두20170418_155628.jpg', '녹두_남색녹두2016-05-03-11-06-50.jpg', '녹두_남원재래2016-05-03-11-04-06.jpg', '녹두_남원재래20160704_102525.jpg', '녹두_돌녹두20160704_113138.jpg', '녹두_봉산2016-05-05-15-09-00.jpg', '녹두_봉산2016-05-08-07-09-49.jpg', '녹두_봉산재래20170418_165303.jpg', '녹두_봉성녹두20170521_135247.jpg', '녹두_예산_재래2016-05-05-14-54-09.jpg', '녹두_올녹두2016-05-03-10-57-59.jpg', '녹두_울산녹두20170521_151627.jpg', '녹두_작은녹두2016-05-03-11-07-49.jpg', '녹두_재래녹두2016-05-03-13-37-18.jpg', '녹두_청포녹두2016-05-03-11-10-10.jpg', '녹두_충북재래2016-05-03-10-59-02.jpg', '녹두_팥녹두20170521_134820.jpg', '녹두_화령녹두20160704_102440.jpg', '녹두_화령청파녹두2016-05-03-11-08-58.jpg', '녹두_화성재래2016-05-03-11-05-25.jpg'],
    '08': ['가지_고창재래2016-05-03-11-43-40 (1).jpg', '가지_남원재래2016-05-03-11-45-03.jpg', '가지_대산2016-05-03-11-46-09.jpg', '가지_백가지2016-05-03-11-23-53.jpg', '가지_청주쇠뿔2016-05-03-13-03-24.jpg', '감_대술_수시감2016-05-06-06-51-18.jpg', '감_예산_쏙소리감2016-05-06-06-53-07.jpg', '고추-거창재래20160704_110537.jpg', '고추-청룡초20160704_110639.jpg', '고추_거창재래2016-05-03-11-30-29.jpg', '고추_곡성초2016-05-03-13-47-17.jpg', '고추_곡성초20160704_110932.jpg', '고추_공주재래2016-05-03-11-26-05.jpg', '고추_대화초2016-05-03-14-31-58.jpg', '고추_대화초20160704_110746.jpg', '고추_붕어초2016-05-03-13-25-44.jpg', '고추_붕어초20160704_110440.jpg', '고추_안동재래2016-05-03-11-31-58.jpg', '고추_연기재래2016-05-03-11-14-07.jpg', '고추_영덕재래2016-05-03-11-33-31.jpg', '고추_영양의 수비초.JPG', '고추_천안재래2016-05-03-11-28-29.jpg', '고추_청룡초2016-05-03-14-12-17.jpg', '고추_칠성초20170418_165146.jpg', '고추_풍각재래2016-05-03-13-24-36.jpg', '고추_풍각재래고추20160704_110837.jpg', '고추_하동재래2016-05-03-11-24-57.jpg', '고추_홍천재래2016-05-03-11-27-22.jpg', '동아_둥근동아20170521_145107.jpg', '박_왕박20170521_151902.jpg', '박_조롱박20170521_145751.jpg', '박_청주참박2016-05-03-13-10-14.jpg', '수박_무등산_산수박_20170418_153625.jpg', '수박_산수박2016-05-01-15-57-21.jpg', '수박_산수박2016-05-03-11-13-06.jpg', '수박_예산수집수박2016-05-01-15-56-23.jpg', '수박_유전자원271055_2016-05-03-11-11-39.jpg', '수박_청주흑수박2016-05-03-13-08-46.jpg', '오이_동외2016-05-03-14-26-12.jpg', '오이_봉산_굵은토종오이2016-05-05-15-13-18.jpg', '오이_봉산_큰오이노각2016-05-05-15-15-29.jpg', '오이_봉성오이20170521_141418.jpg', '오이_예산_노각오이20170521_132850.jpg', '오이_예산오이20170713_083848 (1).jpg', '오이_예산오이20170713_083848 (2).jpg', '오이_제주재래2016-05-03-11-34-32.jpg', '오이_제주재래오이20170418_153124.jpg', '오이_청주조선오이2016-05-03-13-02-05.jpg', '오이_포천조선오이2016-05-03-17-48-31.jpg', '오이_화중재래2016-05-03-11-35-37.jpg', '참외_감참외20170713_083527.jpg', '참외_개구리참외 (3).JPG', '참외_개구리참외1 (1).jpg', '참외_개구리참외1 (2).JPG', '참외_개구리참외1.jpg', '참외_개구리참외20170418_164904.jpg', '참외_괴산노랑참외2016-05-03-13-07-28.jpg', '참외_당진_쇠뿌리참외2016-05-10-06-49-23.jpg', '참외_사과참외20170418_163905.jpg', '참외_수박참외.jpg', '참외_청주개똥참외2016-05-03-13-06-17.jpg', '참외_황해도_감참외20170418_164018.jpg', '탱자-2016-05-03-14-27-23.jpg', '토마토_괴산찰도마토2016-05-03-14-11-02.jpg', '토마토_진안재래2016-05-03-11-38-27.jpg', '호박-울릉호박_2016-05-01-15-35-20.jpg', '호박_긴호박2016-05-01-15-34-15.jpg', '호박_되호박2016-05-01-15-42-19.jpg', '호박_둥근호박2016-05-01-15-39-21.jpg', '호박_둥근호박20170521_135005.jpg', '호박_떡호박20170521_145705.jpg', '호박_떡호박_2016-05-01-15-36-21.jpg', '호박_맷돌호박2016-05-01-15-41-14.jpg', '호박_봉산_긴애호박2016-05-05-15-19-43.jpg', '호박_상리단호박20160808_165606.jpg', '호박_안성_청호박20170521_150401.jpg', '호박_약호박2016-05-01-15-40-16.jpg', '호박_열골호박20170521_134727.jpg', '호박_예산_열골호박20170521_142158.jpg', '호박_참호박2016-05-01-15-37-20.jpg', '호박_청주토종호박2016-05-03-13-04-48.jpg', '호박_청호박2016-05-01-15-38-18.jpg', '호박_평창_긴호박20170521_141939.jpg', '호박_평창국수호박.JPG', '호박_포천_긴호박2016-05-03-17-58-14.jpg'],
    '09': ['갓_노랑갓2016-05-03-13-56-44.jpg', '갓_독지기밑갓2016-05-03-13-48-52.jpg', '갓_두륜산갓2016-05-03-11-58-00.jpg', '갓_적갓2016-05-03-12-04-38.jpg', '갓_청가새2016-05-03-12-01-44.jpg', '갓_청갓20170521_144438.jpg', '갓_토종쑥갓2016-05-03-13-53-08.jpg', '갓_해남2016-05-03-12-03-24.jpg', '무_강ㄹ화순무20160704_113310.jpg', '무_게걸무2016-05-03-14-14-51.jpg', '무_구억배추2016-05-03-14-38-28.jpg', '무_단지무2016-05-03-12-13-20.jpg', '무_산동추2016-05-03-12-55-56.jpg', '무_송정쥐꼬리무 (4).JPG', '무_씨나나빠2016-05-03-12-54-50.jpg', '무_알타리무2016-05-03-12-07-05.jpg', '무_여주의 겔거리무.JPG', '무_열무2016-05-03-12-08-05.jpg', '무_외무2016-05-03-12-14-25.jpg', '무_외무씨20160704_111937.jpg', '무_잎무2016-05-03-12-06-03.jpg', '무_제주수집2016-05-03-12-09-12.jpg', '무_청방2016-05-03-12-52-35.jpg', '무_청방20160704_111853.jpg', '무_케본2016-05-03-12-10-26.jpg', '무_파주_왜무꾸시2016-05-03-17-59-57.jpg', '무_팔공2016-05-03-12-58-19.jpg', '무_풍접초2016-05-03-14-36-19.jpg', '무_하루나2016-05-03-12-53-41.jpg', '무_해남_재래무2016-05-10-10-18-01.jpg', '배추_구억배추.jpg', '배추_구억배추20160704_111503.jpg', '배추_꼬리배추2016-05-03-12-57-06.jpg', '배추_꼬리배추20160704_111419 (1).jpg', '배추_월동초20160704_111721.jpg', '배추_좀배추2016-05-03-12-50-10.jpg', '배추_좀배추20160704_111807.jpg', '배추_진주월동초2016-05-03-12-51-26.jpg', '배추_팔공배추20160704_111419.jpg', '부추_봉산_납작부추2016-05-05-15-23-37 (1).jpg', '부추_에산20170521_144352.jpg', '부추_예산재래20160517_184142.jpg', '부추_조선부추2016-05-03-13-21-46.jpg', '비듬_참비듬2016-05-03-13-51-51.jpg', '상추_담배상추2016-05-03-14-02-11.jpg', '상추_비나리상추20170521_141107.jpg', '상추_적상추2016-05-03-13-50-14.jpg', '상추_적상추20170521_135109.jpg', '상추_키상추20170521_132308.jpg', '상추_평찬청상추2016-05-03-14-42-19.jpg', '상추_평창청상추20160704_111251.jpg', '시금치_ 뿔시금치 (1).JPG', '시금치_경북칠곡시금치20160704_102159.jpg', '시금치_보령_뿔시금치2016-05-10-16-59-30.jpg', '시금치_섬초_2016-05-03-11-39-56.jpg', '시금치_제주2016-05-03-11-42-10.jpg', '시금치_제주재래시금치20170418_155329.jpg', '시금치_조선시금치20170521_132936.jpg', '시금치_칠곡2016-05-03-11-41-10.jpg', '아욱_득지기아욱20170418_164313.jpg', '아욱_붉은 아욱2016-05-03-14-03-47.jpg', '아욱_붉은아욱20160704_111151.jpg', '우엉_우엉초2016-05-03-14-33-26.jpg'],
    '10': ['31.벼룩기장.jpg', '감자_강화분홍감자.JPG', '감자_곡성 하지감자.JPG', '감자_울릉감자.jpg', '결명자2016-05-03-13-34-44.jpg', '고수20170521_144858.jpg', '곤드레20170521_144203.jpg', '귀리_메구귀리20170521_134213.jpg', '기장-흰기장20160704_112956.jpg', '기장_벼룩기장20170521_143508.jpg', '기장_흰기장20170521_141855.jpg', '까마중20170418_153437.jpg', '깨-돌들깨2016-05-01-15-53-26.jpg', '깨-서백하2016-05-01-15-48-14.jpg', '깨-예산수집2016-05-01-15-49-25.jpg', '깨_40일깨2016-05-03-11-53-10.jpg', '깨_60일깨2016-05-03-11-52-04.jpg', '깨_가지깨20170521_150104.jpg', '깨_검은깨20170521_135637.jpg', '깨_검정들깨2016-05-01-15-50-24.jpg', '깨_검정들깨20160704_101641.jpg', '깨_노랑들깨20170521_135753.jpg', '깨_느리깨2016-05-03-11-47-31.jpg', '깨_다닥깨20170521_134303.jpg', '깨_도천깨20170521_140253.jpg', '깨_돌들깨20160704_101809.jpg', '깨_몽촌깨20160704_102029.jpg', '깨_벙어리깨2016-05-03-11-55-25.jpg', '깨_벙어리참깨2016-05-03-13-33-27.jpg', '깨_봉산2016-05-05-15-11-34.jpg', '깨_봉산_참깨2016-05-08-07-07-46.jpg', '깨_섬초20160704_102117.jpg', '깨_소엽_2016-05-01-15-43-34.jpg', '깨_소옆20160704_101948.jpg', '깨_시금자깨2016-05-03-11-48-39.jpg', '깨_시금자깨2016-05-05-15-02-21.jpg', '깨_시금자깨20170418_152635.jpg', '깨_신평참깨20170521_145314.jpg', '깨_예산_재래들깨2016-05-05-14-58-44.jpg', '깨_오전참깨20170521_145934.jpg', '깨_올깨2016-05-03-11-49-51.jpg', '깨_외대깨20170521_135931.jpg', '깨_운계가지깨20170521_140625.jpg', '깨_웅촌깨2016-05-01-15-44-55.jpg', '깨_재래들깨2016-05-03-13-30-55.jpg', '깨_좀들깨20170521_142323.jpg', '깨_주저리깨2016-05-03-11-54-28.jpg', '깨_팔모깨2016-05-03-11-50-49.jpg', '깨_하동수집2016-05-01-15-54-28.jpg', '깨_하동재래20160704_101853.jpg', '깨_횡성올참깨2016-05-03-13-32-22.jpg', '깨_흑임자20170521_133131.jpg', '깨_흰들깨2016-05-01-15-51-24.jpg', '깨_흰들깨20170521_151345.jpg', '깨_흰올ㄷ,ㄹ깨20160704_101722.jpg', '깨_흰올들깨2016-05-01-15-52-36.jpg', '꺠-금촌재래2016-05-01-15-47-09.jpg', '꺠-남원수집2016-05-01-15-46-02.jpg', '꺼먹사리_봉산2016-05-05-15-17-01.jpg', '댑싸이_난장이댑싸리20170418_163309.jpg', '더덕20170521_144032.jpg', '도라지20170521_144524 (1).jpg', '두릅_대술_땅두릅2016-05-06-06-58-58.jpg', '땅콩20170521_140544.jpg', '메밀20170521_142106.jpg', '메밀_ 쓴메밀 (4).JPG', '메밀_경북재래메밀.jpg', '메밀_고성2016-05-03-17-47-13.jpg', '메밀_메밀20170521_133537.jpg', '메밀_쓴메밀.jpg', '메밀_쓴메밀2016-05-03-14-37-24.jpg', '메밀_예산20170418_164729.jpg', '모과2.jpg', '목화_만주재래2016-05-03-12-45-46.jpg', '목화_만주재래20160704_095226.jpg', '목화_회정재래2016-05-03-12-15-43.jpg', '목화_회정재래20160704_095034.jpg', '민들레_흰민들레20170521_143648.jpg', '수세미20170521_140421.jpg', '어수리20170521_143251.jpg', '완두콩20170418_164535.jpg', '완두콩_재래완두2016-05-03-13-29-32.jpg', '완두콩_재래완두콩2016-05-03-14-39-32.jpg', '율무 20170418_162047.jpg', '율무20170521_143857.jpg', '작두콩2016-05-17-18-29-13.jpg', '조-홍천_파란차조2016-05-10-11-39-36.jpg', '조_가지메조20170521_142022.jpg', '조_가지조20160808_164637.jpg', '조_개발이차조20170521_141609.jpg', '조_고양발이조2016-05-03-18-03-45.jpg', '조_구천조20160808_163410.jpg', '조_노랑메조20160808_165213.jpg', '조_노랑차조20160808_164818.jpg', '조_동해차조2016-05-18-18-43-38.jpg', '조_물푸레차조20170521_144114.jpg', '조_뭉탱이차20160808_165357.jpg', '조_세발이차조20170521_152345.jpg', '조_야생_가라지2016-05-03-17-53-08.jpg', '조_에산대술스슥2016-05-05-14-49-48.jpg', '조_여우꼬리조2016-05-03-13-58-04.jpg', '조_여우꼬리조20170521_133351.jpg', '조_올황차조.jpg', '조_원주_노링메조20170521_143154.jpg', '조_진주_붉은조2016-05-03-17-50-17.jpg', '조_청백이차조20170521_153233.jpg', '조_청살미차조.JPG', '조_파란차조2016-05-18-18-45-06.jpg', '조_홍천 메조2016-05-10-11-30-47.jpg', '천방사복장유물 3 호20160704_094427 (1).jpg', '파_부석대파20170521_140044.jpg', '파_에산_똥파20170521_133027.jpg', '파_옛파20170521_142721.jpg', '파_재래종파2016-05-03-13-55-38.jpg', '파_조선대파2016-05-03-13-59-54.jpg', '파_조선파2016-05-03-13-54-25.jpg', '피마자_봉산-도꼬마리2016-05-06-06-49-39.jpg', '피마자_붉은 아주까리2016-05-03-13-16-16.jpg', '피마자_재래아주까리2016-05-03-13-26-55.jpg', '피마자_재래아주까리2016-05-03-14-00-54.jpg', '피마자_청피마자20170521_142851.jpg', '해바라기20170521_152510.jpg', '홍화_토종홍화2016-05-03-13-28-12.jpg', '황기20170521_141812.jpg'],
};

type CheckedItems = {
    '00': boolean;
    [key: string]: boolean;
};

const SeedRelics = () => {
    const [checkedItems, setCheckedItems] = useState<CheckedItems>({
        '00': true,
        '01': true,
        '02': true,
        '03': true,
        '04': true,
        '05': true,
        '06': true,
        '07': true,
        '08': true,
        '09': true,
        '10': true,
    });

    const navigate = useNavigate();
    const [currentPage, setCurrentPage] = useState(1);
    const itemsPerPage = 12;

    const handleAllChange = (event: React.ChangeEvent<HTMLInputElement>) => {
        const allChecked = event.target.checked;

        // 초기값은 현재의 checkedItems 상태를 기반으로 생성
        const updatedState = Object.keys(checkedItems).reduce<CheckedItems>(
            (acc, key) => {
                acc[key] = allChecked; // 모든 항목을 전체 선택 상태로 설정
                return acc;
            },
            { ...checkedItems }
        );

        setCheckedItems(updatedState);
    };

    const handleItemChange = (event: React.ChangeEvent<HTMLInputElement>) => {
        const { name, checked } = event.target;

        setCheckedItems((prevState) => ({
            ...prevState,
            [name]: checked,
            '00': false,
        }));
    };

    const filteredImages = useMemo(() => {
        // 선택된 체크박스 키를 기준으로 이미지 필터링
        const selectedKeys = Object.keys(checkedItems).filter(
            (key) => key !== '00' && checkedItems[key]
        );
        return selectedKeys.flatMap((key) => {
            return imageList[key]?.map((file) => `/seedRelics/${key}/${file}`) || [];
        });
    }, [checkedItems]);

    const paginatedImages = useMemo(() => {
        const startIndex = (currentPage - 1) * itemsPerPage;
        const endIndex = startIndex + itemsPerPage;
        return filteredImages.slice(startIndex, endIndex);
    }, [filteredImages, currentPage]);

    const totalPages = Math.ceil(filteredImages.length / itemsPerPage);

    // 페이지 변경 핸들러
    const handlePaginationChange = (_event: React.ChangeEvent<unknown>, page: number) => {
        setCurrentPage(page);
    };

    const breadcrumbs = [
        <Link underline="hover" key="1" color="inherit" href="/seed/" onClick={() => { navigate('/seed/'); }}>
            Home
        </Link>,
        <Typography key="2" sx={{ color: 'text.primary' }}>
            씨앗유물
        </Typography>,
    ];

    return (
        <Box sx={{ p: 2 }}>
            <Stack spacing={2}>
                <Breadcrumbs
                    separator={<NavigateNextIcon fontSize="small" />}
                    aria-label="breadcrumb"
                >
                    {breadcrumbs}
                </Breadcrumbs>
            </Stack>

            <Box sx={{ pt: 3 }}>
                <Typography
                    variant="h4"
                    component="h1"
                    gutterBottom
                    sx={{ fontWeight: 'bold' }}
                >
                    씨앗유물
                </Typography>
                <Divider sx={{ mt: 3, borderBottomWidth: 3, bgcolor: 'black' }} />
            </Box>

            <Box sx={{ mt: 3, display: 'flex', flexDirection: { xs: 'column', md: 'column' }, alignItems: 'start', justifyContent: 'space-between' }}>
                <Stack spacing={2}>
                    <Box sx={{display: 'flex', flexDirection: { xs: 'column', md: 'row' }}}>
                        <FormGroup
                            sx={{
                                flexDirection: 'row',
                                border: '1px solid black',
                                borderRadius: 2,
                                pl: 2,
                            }}
                        >
                            <FormControlLabel
                                control={
                                    <Checkbox
                                        checked={checkedItems['00']}
                                        onChange={handleAllChange}
                                        name='00'
                                    />
                                }
                                label="전체"
                            />

                            {[
                                {label: '벼', code: '01'},
                                {label: '보리', code: '02'},
                                {label: '밀', code: '03'},
                                {label: '콩/강낭콩', code: '04'},
                                {label: '수수/옥수수', code: '05'},
                                {label: '팥', code: '06'},
                                {label: '녹두', code: '07'},
                                {label: '과채', code: '08'},
                                {label: '엽경채', code: '09'},
                                {label: '기타', code: '10'},
                            ].map((data) => (
                                <FormControlLabel
                                    key={data.code}
                                    control={
                                        <Checkbox
                                            checked={checkedItems[data.code]}
                                            onChange={handleItemChange}
                                            name={data.code}
                                        />
                                    }
                                    label={data.label}
                                />
                            ))}
                        </FormGroup>
                    </Box>
                </Stack>
            </Box>

            <Box sx={{mt: 3, display: 'flex', flexDirection: 'row'}}>
                <Typography variant="h6">총</Typography>
                <Typography variant="h6" sx={{pl: 1}}>{filteredImages.length}</Typography>
                <Typography variant="h6" sx={{pl: 0.5}}>점의 유물정보가 있습니다.</Typography>
            </Box>

            <Divider sx={{ mt: 2, borderBottomWidth: 2, bgcolor: 'black' }} />

            <Box sx={{ my: 3 }}>
                <Box
                    sx={{
                        display: 'grid',
                        gridTemplateColumns: 'repeat(4, 1fr)',
                        gap: 2
                    }}
                >
                    {paginatedImages.map((src, index) => (
                        <img
                            key={index}
                            src={src}
                            alt="씨앗유물"
                            loading="lazy"
                            style={{
                                width: 260,
                                height: 260,
                                objectFit: 'cover',
                            }}
                        />
                    ))}
                </Box>

                {filteredImages.length === 0 && (
                    <Box sx={{height: 600}}/>
                )}
            </Box>

            <Box>
                <Box sx={{ display: "flex", justifyContent: "center", mt: 4 }}>
                    <Pagination
                        count={totalPages}
                        page={currentPage}
                        onChange={handlePaginationChange}
                        shape="rounded"
                        color="primary"
                    />
                </Box>
            </Box>
        </Box>
    );
};

export default SeedRelics;