import {
    Box,
    Breadcrumbs,
    Divider,
    Link, Paper,
    Stack,
    Typography, Pagination, Tabs, Tab,
} from "@mui/material";
import NavigateNextIcon from '@mui/icons-material/NavigateNext';
import {useNavigate} from "react-router-dom";
import React, {useEffect, useState} from "react";

const imageList1 = ['1667157916882_압축.jpg', '1667157934865_압축.jpg', '1667157962798_압축.jpg', '1667157979590_압축.jpg', '1667158001948_압축.jpg', '1667158008241_압축.jpg', '1667158011971_압축.jpg', '1667158015663_압축.jpg', '1667158027930_압축.jpg', '1667158036180_압축.jpg', '1667158040156_압축.jpg', '1667158056981_압축.jpg', '1667158073374_압축.jpg', '1667158079119_압축.jpg', '1667158084358_압축.jpg', '1667158087068_압축.jpg', '1667158098251_압축.jpg', '1667158101733_압축.jpg', '1667158121390_압축.jpg', '1667158127331_압축.jpg', '1667158130948_압축.jpg', '1667158143719_압축.jpg', '1667158149523_압축.jpg', '1667158166801_압축.jpg', '1667158194727_압축.jpg', '1667158198169_압축.jpg', '1667158205374_압축.jpg', '1667158216206_압축.jpg', '1667158234441_압축.jpg', '1667158239775_압축.jpg', '1667158265130_압축.jpg', '1667158289527_압축.jpg', '1667158297659_압축.jpg', '1667158321755_압축.jpg', '1667158329646_압축.jpg', '1667158345166_압축.jpg', '1667158352584_압축.jpg', '1667158370665_압축.jpg', '1667158378220_압축.jpg', '1667158393958_압축.jpg', '1667158399601_압축.jpg', '1667158412752_압축.jpg', '1667158420631_압축.jpg', '1667158423639_압축.jpg', '1667158432792_압축.jpg', '1667158439306_압축.jpg', '1667158442223_압축.jpg', '1667158445308_압축.jpg', '1667158453758_압축.jpg', '1667158456583_압축.jpg', '1667158459617_압축.jpg', '1667158464320_압축.jpg', '1667158469131_압축.jpg', '1667158474173_압축.jpg', '1667158478976_압축.jpg', '1667158483526_압축.jpg', '1667158487829_압축.jpg', '1667158495795_압축.jpg', '1667158499070_압축.jpg', '1667158513220_압축.jpg', '1667158520441_압축.jpg', '1667158523153_압축.jpg', '1667158528775_압축.jpg', '1667158532284_압축.jpg', '1667158537441_압축.jpg', '1667158542176_압축.jpg', '1667158544989_압축.jpg', '1667158554015_압축.jpg', '1667158562702_압축.jpg', '1667158574426_압축.jpg', '1667158579560_압축.jpg', '1667158593360_압축.jpg', '1667158598869_압축.jpg', '1667158605355_압축.jpg', '1667158608812_압축.jpg', '1667158612538_압축.jpg', '1667158715770_압축.jpg', '1667158734455_압축.jpg', '1667158744225_압축.jpg', '1667158753075_압축.jpg', '1667158776807_압축.jpg', '1667158787046_압축.jpg', '1667158790122_압축.jpg', '1667158793164_압축.jpg', '1667158796012_압축.jpg', '1667158800252_압축.jpg', '1667158803177_압축.jpg', '1667158810422_압축.jpg', '1667158818750_압축.jpg', '1667158828618_압축.jpg', '1667158833916_압축.jpg', '1667158839938_압축.jpg', '1667158848354_압축.jpg', '1667158851086_압축.jpg', '1667158854875_압축.jpg', '1667158858077_압축.jpg', '1667158862504_압축.jpg', '1667158869084_압축.jpg', '1667158871678_압축.jpg', '1667158875044_압축.jpg', '1667158877656_압축.jpg', '1667158896980_압축.jpg', '1667158950537_압축.jpg', '1667158954723_압축.jpg', '1667158959641_압축.jpg', '1667158963071_압축.jpg', '1667158975959_압축.jpg', '1667158982541_압축.jpg', '1667158987240_압축.jpg', '1667158997489_압축.jpg', '1667159001647_압축.jpg', '1667159011377_압축.jpg', '1667159025876_압축.jpg', '1667159029552_압축.jpg', '1667159036579_압축.jpg', '1667159037909_압축.jpg', '1667159041750_압축.jpg', '1667159047579_압축.jpg', '1667159052739_압축.jpg', '1667159060681_압축.jpg', '1667159064222_압축.jpg', '1667159076025_압축.jpg', '1667159088027_압축.jpg', '1667159109446_압축.jpg', '1667159117550_압축.jpg', '1667159121957_압축.jpg', '1667159125567_압축.jpg', '1667159131341_압축.jpg', '1667159142717_압축.jpg', '1667159156329_압축.jpg', '1667159166899_압축.jpg', '1667159173426_압축.jpg', '1667159176110_압축.jpg', '1667159186424_압축.jpg', '1667159189295_압축.jpg', '1667159204813_압축.jpg', '1667159214805_압축.jpg', '1667159217597_압축.jpg', '1667159220211_압축.jpg', '1667159225039_압축.jpg', '1667159229943_압축.jpg', '1667159232760_압축.jpg', '1667159251715_압축.jpg', '1667159256189_압축.jpg', '1667159273759_압축.jpg', '1667159277483_압축.jpg', '1667159280199_압축.jpg', '1667159297602_압축.jpg', '1667159315355_압축.jpg', '1667159334475_압축.jpg', '1667159353221_압축.jpg', '1667159358569_압축.jpg', '1667159365268_압축.jpg', '1667159373917_압축.jpg', '1667159377041_압축.jpg', '1667159387272_압축.jpg', '1667159389862_압축.jpg', '1667159392911_압축.jpg', '1667159404636_압축.jpg', '1667159407062_압축.jpg', '1667159412091_압축.jpg', '1667159416679_압축.jpg', '1667159430233_압축.jpg', '1667159456208_압축.jpg', '1667159463657_압축.jpg', '1667159468126_압축.jpg', '1667159476982_압축.jpg', '1667159494962_압축.jpg', '1667159497973_압축.jpg', '1667159504598_압축.jpg', '1667159507437_압축.jpg', '1667159513908_압축.jpg', '1667159528302_압축.jpg', '1667159530746_압축.jpg', '1667159537210_압축.jpg', '1667159558367_압축.jpg', '1667159567582_압축.jpg', '1667159571155_압축.jpg', '1667159576142_압축.jpg', '1667159585595_압축.jpg', '1667159588395_압축.jpg', '1667159602308_압축.jpg', '1667159609407_압축.jpg', '1667159621576_압축.jpg', '1667159628097_압축.jpg', '1667159635305_압축.jpg', '1667159650713_압축.jpg', '1667159654974_압축.jpg', '1667159657912_압축.jpg', '1667159660752_압축.jpg', '1667159671522_압축.jpg', '1667159683562_압축.jpg', '1667159690434_압축.jpg', '1667159703139_압축.jpg', '1667159713932_압축.jpg', '1667159718321_압축.jpg', '1667159725071_압축.jpg', '1667159737590_압축.jpg', '1667159739521_압축.jpg', '1667159742212_압축.jpg', '1667159749745_압축.jpg', '1667159756000_압축.jpg', '1667159761256_압축.jpg', '1667159778580_압축.jpg', '1667159784127_압축.jpg', '1667159788533_압축.jpg', '1667159800411_압축.jpg', '1667159804238_압축.jpg', '1667159807685_압축.jpg', '1667159811136_압축.jpg', '1667159814331_압축.jpg', '1667159817660_압축.jpg', '1667159829227_압축.jpg', '1667159831750_압축.jpg', '1667159842327_압축.jpg', '1667159845925_압축.jpg', '1667159849195_압축.jpg', '1667159926964_압축.jpg', '1667159934372_압축.jpg', '1667159973077_압축.jpg', '1667159980507_압축.jpg', '1667159984291_압축.jpg', '1667159989159_압축.jpg', '1667159992664_압축.jpg', '1667159998118_압축.jpg', '1667160006014_압축.jpg', '1667160023964_압축.jpg', '1667160031949_압축.jpg', '1667160039344_압축.jpg', '1667160057803_압축.jpg', '1667160064364_압축.jpg', '1667160071124_압축.jpg', '1667160093980_압축.jpg', '1667160106514_압축.jpg', '1667160116892_압축.jpg', '1667160124830_압축.jpg', '1667160128308_압축.jpg', '1667160134697_압축.jpg', '1667160139124_압축.jpg', '1667160147860_압축.jpg', '1667160168622_압축.jpg', '1667160188634_압축.jpg', '1667160203816_압축.jpg', '1667160231031_압축.jpg', '1667160234353_압축.jpg', '1667160237682_압축.jpg', '1667160238134_압축.jpg', '1667160246276_압축.jpg', '1667160249371_압축.jpg', '1667160257418_압축.jpg', '1667160270177_압축.jpg', '1667160277574_압축.jpg', '1667160296432_압축.jpg', '1667160300658_압축.jpg', '1667160313297_압축.jpg', '1667160315375_압축.jpg', '1667160331664_압축.jpg', '1667160344875_압축.jpg', '1667160348254_압축.jpg', '1667160356280_압축.jpg', '1667160364030_압축.jpg', '1667160375029_압축.jpg', '1667160386807_압축.jpg', '1667160396478_압축.jpg', '1667160404236_압축.jpg', '1667160413989_압축.jpg', '1667160419617_압축.jpg', '1667160434835_압축.jpg', '1667160443194_압축.jpg', '1667160449713_압축.jpg', '1667160461783_압축.jpg', '1667160470300_압축.jpg', '1667160476447_압축.jpg', '1667160489374_압축.jpg', '1667160497301_압축.jpg', '1667160507821_압축.jpg', '1667160512988_압축.jpg', '1667160515991_압축.jpg', '1667160533500_압축.jpg', '1667160536700_압축.jpg', '1667160544100_압축.jpg', '1667160547348_압축.jpg', '1667160555845_압축.jpg', '1667160560455_압축.jpg', '1667160570531_압축.jpg', '1667160576501_압축.jpg', '1667160579864_압축.jpg', '1667160603887_압축.jpg', '1667160609182_압축.jpg', '1667160616817_압축.jpg', '1667160626501_압축.jpg', '1667160630246_압축.jpg', '1667160639698_압축.jpg', '1667160642439_압축.jpg', '1667160645392_압축.jpg', '1667160652378_압축.jpg', '1667160655013_압축.jpg', '1667160658022_압축.jpg', '1667160660432_압축.jpg', '1667160668543_압축.jpg', '1667160671723_압축.jpg', '1667160675910_압축.jpg', '1667160679896_압축.jpg', '1667160683069_압축.jpg', '1667160686034_압축.jpg', '1667160696503_압축.jpg', '1667160699756_압축.jpg', '1667160702891_압축.jpg', '1667160707966_압축.jpg', '1667160711360_압축.jpg', '1667160714759_압축.jpg', '1667160726339_압축.jpg', '1667160731689_압축.jpg', '1667160736628_압축.jpg', '1667160740334_압축.jpg', '1667160745373_압축.jpg', '1667160750582_압축.jpg', '1667160759195_압축.jpg', '1667160769185_압축.jpg', '1667160772343_압축.jpg', '1667160775431_압축.jpg', '1667160782705_압축.jpg', '1667160785833_압축.jpg', '1667160789272_압축.jpg', '1667160794954_압축.jpg', '1667160798123_압축.jpg', '1667160801271_압축.jpg', '1667160806174_압축.jpg', '1667160809391_압축.jpg', '1667160814130_압축.jpg', '1667160818130_압축.jpg', '1667160820894_압축.jpg', '20221029_103530_압축.jpg', '20221029_103540_압축.jpg', '20221029_103557_압축.jpg', '20221029_113616_압축.jpg', '20221029_113621_압축.jpg', '20221029_113624_압축.jpg', '20221029_122842_압축.jpg', '20221029_123020_압축.jpg', '20221029_123049_압축.jpg', '20221029_123110_압축.jpg', '20221029_123138_압축.jpg', '20221029_123155_압축.jpg', '20221029_123159_압축.jpg', '20221029_123212_압축.jpg', '20221029_123253_압축.jpg', '20221029_123255_압축.jpg', '20221029_123322_압축.jpg', '20221029_123331_압축.jpg', '20221029_123503_압축.jpg', '20221029_123504_압축.jpg', '20221029_123515_압축.jpg', '20221029_123529_압축.jpg', '20221029_123531_압축.jpg', '20221029_123540_압축.jpg', '20221029_123557_압축.jpg', '20221029_123631_압축.jpg', '20221029_123714_압축.jpg', '20221029_123733_압축.jpg', '20221029_123736_압축.jpg', '20221029_123738_압축.jpg', '20221029_123744_압축.jpg', '20221029_123748_압축.jpg', '20221029_123755_압축.jpg', '20221029_123807_압축.jpg', '20221029_123813_압축.jpg', '20221029_123901_압축.jpg', '20221029_123902_압축.jpg', '20221029_123904_압축.jpg', '20221029_123925_압축.jpg', '20221029_124052_압축.jpg', '20221029_124053_압축.jpg', '20221029_124055_압축.jpg', '20221029_124104_압축.jpg', '20221029_124128_압축.jpg', '20221029_124202_압축.jpg', '20221029_124203_압축.jpg', '20221029_124210_압축.jpg', '20221029_124223_압축.jpg', '20221029_124620_압축.jpg', '20221029_124622_압축.jpg', '20221029_124826_압축.jpg', '20221029_124925_압축.jpg', '20221029_124937_압축.jpg', '20221029_125015_압축.jpg', '20221029_125020_압축.jpg', '20221029_125122_압축.jpg', '20221029_130616_압축.jpg', '20221029_130628_압축.jpg', '20221029_130640_압축.jpg', '20221029_130645_압축.jpg', '20221029_130657_압축.jpg', '20221029_130708_압축.jpg', '20221029_130721_압축.jpg', '20221029_130728_압축.jpg', '20221029_130742_압축.jpg', '20221029_130751_압축.jpg', '20221029_130813_압축.jpg', '20221029_130838_압축.jpg', '20221029_131226_압축.jpg', '20221029_131237_압축.jpg', '20221029_131242_압축.jpg', '20221107_104253_압축.jpg', 'DSCF1278_압축.jpg', 'DSCF1302_압축.jpg', 'DSCF1330_압축.jpg', 'DSCF1355_압축.jpg', 'DSCF1358_압축.jpg', 'DSCF1368_압축.jpg', 'DSCF1370_압축.jpg', 'DSCF1381_압축.jpg', 'DSCF1391_압축.jpg', 'DSCF1408_압축.jpg', 'DSCF1411_압축.jpg', 'DSCF1463_압축.jpg', 'DSCF1490_압축.jpg', 'DSCF1498_압축.jpg', 'DSCF1500_압축.jpg', 'DSCF1501_압축.jpg', 'DSCF1503_압축.jpg', 'DSCF1513_압축.jpg', 'DSCF1519_압축.jpg', 'DSCF1524_압축.jpg', 'DSCF1531_압축.jpg', 'DSCF1542_압축.jpg', 'DSCF1561_압축.jpg', 'DSCF1562_압축.jpg', 'DSCF1576_압축.jpg', 'DSCF1583_압축.jpg', 'DSCF1594_압축.jpg', 'DSCF1595_압축.jpg', 'DSCF1597_압축.jpg', 'DSCF1604_압축.jpg', 'DSCF1607_압축.jpg', 'DSCF1627_압축.jpg', 'DSCF1639_압축.jpg', 'DSCF1647_압축.jpg', 'DSCF1653_압축.jpg', 'DSCF1662_압축.jpg', 'DSCF1664_압축.jpg', 'DSCF1670_압축.jpg', '신문 사진_압축.jpg'];
const imageList2 = ['20211127_103621_압축.jpg', '20211127_103624_압축.jpg', '20211127_103637_압축.jpg', '20211127_103910_압축.jpg', '20211127_103918 (2)_압축.jpg', '20211127_103918 (3)_압축.jpg', '20211127_103918_압축.jpg', '20211127_104116_압축.jpg', '20211127_104126_압축.jpg', '20211127_104145_압축.jpg', '20211127_104455_압축.jpg', '20211127_104503_압축.jpg', '20211127_105907_압축.jpg', '20211127_113759_압축.jpg', '20211127_113802_압축.jpg', '20211127_114732_압축.jpg', '20211127_114821_압축.jpg', '20211127_114827_압축.jpg', '20211127_120246_압축.jpg', '20211127_120251_압축.jpg', '20211127_120253_압축.jpg'];
const imageList3 = ['20201112_115031_압축.jpg', '20201114_131642_압축.jpg', '20201114_131652_압축.jpg', '20201114_131909_압축.jpg', '20201114_132226_압축.jpg', '20211127_091904_압축.jpg', '20211127_091925_압축.jpg', '20211127_091931_압축.jpg', '20211127_100355_압축.jpg', '20211127_103626_압축.jpg', '20211127_103638(0)_압축.jpg', '20211127_103638_압축.jpg', '20211127_104755_압축.jpg', '20211127_104805_압축.jpg', '20211127_104831_압축.jpg', '20211127_104837_압축.jpg', '20211127_104839_압축.jpg', '20211127_104913_압축.jpg', '20211127_104941_압축.jpg', '20211127_105006_압축.jpg', '20211127_105230_압축.jpg', '20211127_105420_압축.jpg', '20211127_105435_압축.jpg', '20211127_105455_압축.jpg', '20211127_105513_압축.jpg', '20211127_111445_압축.jpg', '20211127_111505_압축.jpg', '20211127_111506_압축.jpg', '20211127_111530_압축.jpg', '20211127_111743_압축.jpg', '20211127_112012_압축.jpg', '20211127_112016_압축.jpg', '20211127_112027_압축.jpg', '20211127_113723_압축.jpg', '20211127_113735_압축.jpg', '20211127_113739_압축.jpg', '20211127_113749_압축.jpg', '20211127_113804_압축.jpg', '20211127_113828_압축.jpg', '20211127_113833_압축.jpg', '20211127_113916_압축.jpg', '20211127_113918_압축.jpg', '20211127_113919_압축.jpg', '20211127_113921_압축.jpg', '20211127_113932_압축.jpg', '20211127_113933_압축.jpg', '20211127_113936_압축.jpg', '20211127_113940_압축.jpg', '20211127_113941_압축.jpg', '20211127_114306_압축.jpg', '20211127_114437_압축.jpg', '20211127_114446_압축.jpg', '20211127_114451_압축.jpg', '20211127_114458_압축.jpg', '20211127_114905_압축.jpg', '20211127_114927_압축.jpg', '20211127_114958_압축.jpg', '20211127_120234_압축.jpg', '20211127_120243_압축.jpg', '20211127_120245_압축.jpg', '20211127_120253_압축.jpg', '20211127_120300_압축.jpg', '20211127_120301_압축.jpg', '20211127_120313_압축.jpg', '20211127_120320_압축.jpg', '20211127_120321_압축.jpg', '20211127_120322_압축.jpg', '20211127_121231_압축.jpg', '20211127_121235_압축.jpg', '20211127_122807_압축.jpg', '20211202_121241_압축.jpg', '20211202_121259_압축.jpg', '20211202_121606_압축.jpg', '20211202_121618_압축.jpg', '20211202_133154_압축.jpg', 'FB_IMG_1605352470828_압축.jpg'];
const imageList4 = ['20190926_105321_압축.jpg', '20190926_105338_압축.jpg', '20190926_105343_압축.jpg', '20190926_105351_압축.jpg', '20190926_105400_압축.jpg', '20190926_105444_압축.jpg', '20190926_105910_압축.jpg', '20190926_105944_압축.jpg', '20190926_105946_압축.jpg', '20190926_111838_압축.jpg', '20190926_111849_압축.jpg', '20190926_111900_압축.jpg', '20190926_111901_압축.jpg', '20190926_112017_압축.jpg', '20190926_112023_압축.jpg', '20190926_112604_압축.jpg', '20190926_112618_압축.jpg', '20190926_112911_압축.jpg', '20190926_112919_압축.jpg', '20190926_112938_압축.jpg', '20190929_154338_압축.jpg', '20190929_154444_압축.jpg', '20191020_154051_001_압축.jpg', '20191021_100117_압축.jpg', '20191021_100142_압축.jpg', '20191021_100210_압축.jpg', '20191021_100211_압축.jpg', '20191021_100651_압축.jpg', '20191102_095411_압축.jpg', '20191102_095425_압축.jpg', '20191102_095441_압축.jpg', '20191102_095535_압축.jpg', '20191102_095539_압축.jpg', '20191102_095747_압축.jpg', '20191102_095750_압축.jpg', '20191102_100659_압축.jpg', '20191102_101729_압축.jpg', '20191102_104911_압축.jpg', '20191102_104917_압축.jpg', '20191102_104937(0)_압축.jpg', '20191102_104938_압축.jpg', '20191102_104943_압축.jpg', '20191102_111345_압축.jpg', '20191102_111350_압축.jpg', '20191102_111359_압축.jpg', '20191102_111404_압축.jpg', '20191102_111439_압축.jpg', '20191102_111440_압축.jpg', '20191102_111450_압축.jpg', '20191102_111452_압축.jpg', '20191102_111510_압축.jpg', '20191102_111531_압축.jpg', '20191102_111646_압축.jpg', '20191102_111647_압축.jpg', '20191102_111655_압축.jpg', '20191102_111731_압축.jpg', '20191102_111732_압축.jpg', '20191102_111735_압축.jpg', '20191102_111812_압축.jpg', '20191102_111816_압축.jpg', '20191102_111953_압축.jpg', '20191102_112058_압축.jpg', '20191102_112305_압축.jpg', '20191102_112306_압축.jpg', '20191102_112325_압축.jpg', '20191102_112329_압축.jpg', '20191102_113236_압축.jpg', '20191102_114037_압축.jpg', '20191102_114533_압축.jpg', '20191102_114534_압축.jpg', '20191102_114612_압축.jpg', '20191102_114623_압축.jpg', '20191102_114625_압축.jpg', '20191125_164304_압축.jpg', '20191125_164356_압축.jpg', '20191125_164443_압축.jpg', '20191125_164508_압축.jpg', '20191125_164621_압축.jpg', '20191125_164707_압축.jpg', '20191125_164736_압축.jpg'];

const Festival = () => {
    const navigate = useNavigate();
    const [mainTab, setMainTab] = useState(0); // 상위 탭 (제1관, 제2관 등) 관리
    const [currentPage, setCurrentPage] = useState(1);
    const itemsPerPage = 12;
    const startIndex = (currentPage - 1) * itemsPerPage;
    const endIndex = startIndex + itemsPerPage;

    const handleMainTabChange = (_: React.SyntheticEvent, newValue: number) => {
        setMainTab(newValue);
        setCurrentPage(1);
        window.scrollTo(0, 0);
    };

    const handlePaginationChange = (_event: React.ChangeEvent<unknown>, page: number) => {
        setCurrentPage(page);
    };


    const totalPages1 = Math.ceil(imageList1.length / itemsPerPage);
    const totalPages2 = Math.ceil(imageList2.length / itemsPerPage);
    const totalPages3 = Math.ceil(imageList3.length / itemsPerPage);
    const totalPages4 = Math.ceil(imageList3.length / itemsPerPage);

    useEffect(() => {
        window.scrollTo(0, 0);
    }, []);

    const Exhibit1 = () => (
        <Paper elevation={3} sx={{ p: 4, borderRadius: 2 }}>
            <Box>
                <Box
                    sx={{
                        display: 'grid',
                        gridTemplateColumns: {
                            xs: 'repeat(1, 1fr)',
                            sm: 'repeat(2, 1fr)',
                            md: 'repeat(4, 1fr)',
                        },
                        gap: 2
                    }}
                >
                    {imageList1.slice(startIndex, endIndex).map((src, index) => {
                        return (
                            <Box
                                key={index}
                                sx={{
                                    display: 'flex',
                                    flexDirection: 'column',
                                    alignItems: 'center',
                                    width: 280,
                                }}
                            >
                                <Box
                                    key={index}
                                    sx={{
                                        display: 'flex',
                                        flexDirection: 'column',
                                        alignItems: 'center',
                                        width: 280,
                                    }}
                                >
                                    {/* 이미지 */}
                                    <a
                                        href={`/event/축제, 팜파티/2022/${src}`}
                                        target="_blank"
                                        rel="noopener noreferrer"
                                        style={{ textDecoration: 'none' }}
                                    >
                                        <img
                                            src={`/event/축제, 팜파티/2022/${src}`}
                                            alt={src}
                                            loading="lazy"
                                            style={{
                                                width: 280,
                                                height: 280,
                                                objectFit: 'cover',
                                                borderRadius: 8,
                                            }}
                                        />
                                    </a>
                                </Box>
                            </Box>
                        );
                    })}
                </Box>

                {imageList1.length === 0 && (
                    <Box sx={{height: 600}}/>
                )}
            </Box>

            <Box>
                <Box sx={{ display: "flex", justifyContent: "center", mt: 4 }}>
                    <Pagination
                        count={totalPages1}
                        page={currentPage}
                        onChange={handlePaginationChange}
                        shape="rounded"
                        color="primary"
                    />
                </Box>
            </Box>
        </Paper>
    );

    const Exhibit2 = () => (
        <Paper elevation={3} sx={{ p: 4, borderRadius: 2 }}>
            <Box>
                <Box
                    sx={{
                        display: 'grid',
                        gridTemplateColumns: {
                            xs: 'repeat(1, 1fr)',
                            sm: 'repeat(2, 1fr)',
                            md: 'repeat(4, 1fr)',
                        },
                        gap: 2
                    }}
                >
                    {imageList2.slice(startIndex, endIndex).map((src, index) => {
                        return (
                            <Box
                                key={index}
                                sx={{
                                    display: 'flex',
                                    flexDirection: 'column',
                                    alignItems: 'center',
                                    width: 280,
                                }}
                            >
                                <Box
                                    key={index}
                                    sx={{
                                        display: 'flex',
                                        flexDirection: 'column',
                                        alignItems: 'center',
                                        width: 280,
                                    }}
                                >
                                    {/* 이미지 */}
                                    <a
                                        href={`/event/축제, 팜파티/2021/${src}`}
                                        target="_blank"
                                        rel="noopener noreferrer"
                                        style={{ textDecoration: 'none' }}
                                    >
                                        <img
                                            src={`/event/축제, 팜파티/2021/${src}`}
                                            alt={src}
                                            loading="lazy"
                                            style={{
                                                width: 280,
                                                height: 280,
                                                objectFit: 'cover',
                                                borderRadius: 8,
                                            }}
                                        />
                                    </a>
                                </Box>
                            </Box>
                        );
                    })}
                </Box>

                {imageList2.length === 0 && (
                    <Box sx={{height: 600}}/>
                )}
            </Box>

            <Box>
                <Box sx={{ display: "flex", justifyContent: "center", mt: 4 }}>
                    <Pagination
                        count={totalPages2}
                        page={currentPage}
                        onChange={handlePaginationChange}
                        shape="rounded"
                        color="primary"
                    />
                </Box>
            </Box>
        </Paper>
    );

    const Exhibit3 = () => (
        <Paper elevation={3} sx={{ p: 4, borderRadius: 2 }}>
            <Box>
                <Box
                    sx={{
                        display: 'grid',
                        gridTemplateColumns: {
                            xs: 'repeat(1, 1fr)',
                            sm: 'repeat(2, 1fr)',
                            md: 'repeat(4, 1fr)',
                        },
                        gap: 2
                    }}
                >
                    {imageList3.slice(startIndex, endIndex).map((src, index) => {
                        return (
                            <Box
                                key={index}
                                sx={{
                                    display: 'flex',
                                    flexDirection: 'column',
                                    alignItems: 'center',
                                    width: 280,
                                }}
                            >
                                <Box
                                    key={index}
                                    sx={{
                                        display: 'flex',
                                        flexDirection: 'column',
                                        alignItems: 'center',
                                        width: 280,
                                    }}
                                >
                                    {/* 이미지 */}
                                    <a
                                        href={`/event/축제, 팜파티/2020/${src}`}
                                        target="_blank"
                                        rel="noopener noreferrer"
                                        style={{ textDecoration: 'none' }}
                                    >
                                        <img
                                            src={`/event/축제, 팜파티/2020/${src}`}
                                            alt={src}
                                            loading="lazy"
                                            style={{
                                                width: 280,
                                                height: 280,
                                                objectFit: 'cover',
                                                borderRadius: 8,
                                            }}
                                        />
                                    </a>
                                </Box>
                            </Box>
                        );
                    })}
                </Box>

                {imageList3.length === 0 && (
                    <Box sx={{height: 600}}/>
                )}
            </Box>

            <Box>
                <Box sx={{ display: "flex", justifyContent: "center", mt: 4 }}>
                    <Pagination
                        count={totalPages3}
                        page={currentPage}
                        onChange={handlePaginationChange}
                        shape="rounded"
                        color="primary"
                    />
                </Box>
            </Box>
        </Paper>
    );

    const Exhibit4 = () => (
        <Paper elevation={3} sx={{ p: 4, borderRadius: 2 }}>
            <Box>
                <Box
                    sx={{
                        display: 'grid',
                        gridTemplateColumns: {
                            xs: 'repeat(1, 1fr)',
                            sm: 'repeat(2, 1fr)',
                            md: 'repeat(4, 1fr)',
                        },
                        gap: 2
                    }}
                >
                    {imageList4.slice(startIndex, endIndex).map((src, index) => {
                        return (
                            <Box
                                key={index}
                                sx={{
                                    display: 'flex',
                                    flexDirection: 'column',
                                    alignItems: 'center',
                                    width: 280,
                                }}
                            >
                                <Box
                                    key={index}
                                    sx={{
                                        display: 'flex',
                                        flexDirection: 'column',
                                        alignItems: 'center',
                                        width: 280,
                                    }}
                                >
                                    {/* 이미지 */}
                                    <a
                                        href={`/event/축제, 팜파티/2019/${src}`}
                                        target="_blank"
                                        rel="noopener noreferrer"
                                        style={{ textDecoration: 'none' }}
                                    >
                                        <img
                                            src={`/event/축제, 팜파티/2019/${src}`}
                                            alt={src}
                                            loading="lazy"
                                            style={{
                                                width: 280,
                                                height: 280,
                                                objectFit: 'cover',
                                                borderRadius: 8,
                                            }}
                                        />
                                    </a>
                                </Box>
                            </Box>
                        );
                    })}
                </Box>

                {imageList4.length === 0 && (
                    <Box sx={{height: 600}}/>
                )}
            </Box>

            <Box>
                <Box sx={{ display: "flex", justifyContent: "center", mt: 4 }}>
                    <Pagination
                        count={totalPages4}
                        page={currentPage}
                        onChange={handlePaginationChange}
                        shape="rounded"
                        color="primary"
                    />
                </Box>
            </Box>
        </Paper>
    );

    const breadcrumbs = [
        <Link underline="hover" key="1" color="inherit" href="/seed/" onClick={() => {
            navigate('/seed/');
        }}>
            Home
        </Link>,
        <Typography key="2" sx={{color: 'text.primary'}}>
            문화행사
        </Typography>,
        <Typography key="2" sx={{color: 'text.primary'}}>
            축제 / 팜파티
        </Typography>,
    ];

    return (
        <Box sx={{ p: 2 }}>
            <Stack spacing={2}>
                <Breadcrumbs
                    separator={<NavigateNextIcon fontSize="small" />}
                    aria-label="breadcrumb"
                >
                    {breadcrumbs}
                </Breadcrumbs>
            </Stack>

            <Box sx={{ pt: 3 }}>
                <Typography
                    variant="h4"
                    component="h1"
                    gutterBottom
                    sx={{ fontWeight: 'bold' }}
                >
                    축제 / 팜파티
                </Typography>
                <Divider sx={{ mt: 3, borderBottomWidth: 3, bgcolor: 'black' }} />
            </Box>

            <Box sx={{ p: 3 }}>
                {/* 상위 탭 */}
                <Tabs value={mainTab} onChange={handleMainTabChange}>
                    <Tab label="2022년" />
                    <Tab label="2021년" />
                    <Tab label="2020년" />
                    <Tab label="2019년" />
                </Tabs>
                <Box sx={{ mt: 2 }}>
                    {mainTab === 0 && <Exhibit1 />}
                    {mainTab === 1 && <Exhibit2 />}
                    {mainTab === 2 && <Exhibit3 />}
                    {mainTab === 3 && <Exhibit4 />}
                </Box>
            </Box>
        </Box>
    );
};

export default Festival;